{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 6, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "33", "class_name": "ZeroPadding2D", "config": {"name": "33", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "34", "class_name": "Conv2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["33", 0, 0, {}]]]}, {"name": "35", "class_name": "Activation", "config": {"name": "35", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["34", 0, 0, {}]]]}, {"name": "62", "class_name": "UpSampling2D", "config": {"name": "62", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "inbound_nodes": [[["35", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 12, 40], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "63", "class_name": "Concatenate", "config": {"name": "63", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["62", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "64", "class_name": "ZeroPadding2D", "config": {"name": "64", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["63", 0, 0, {}]]]}, {"name": "65", "class_name": "Conv2D", "config": {"name": "65", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["64", 0, 0, {}]]]}, {"name": "66", "class_name": "Activation", "config": {"name": "66", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["65", 0, 0, {}]]]}, {"name": "67", "class_name": "ZeroPadding2D", "config": {"name": "67", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["66", 0, 0, {}]]]}, {"name": "68", "class_name": "Conv2D", "config": {"name": "68", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["67", 0, 0, {}]]]}, {"name": "69", "class_name": "Activation", "config": {"name": "69", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["68", 0, 0, {}]]]}, {"name": "96", "class_name": "UpSampling2D", "config": {"name": "96", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "inbound_nodes": [[["69", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 24, 80], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "97", "class_name": "Concatenate", "config": {"name": "97", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["96", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "98", "class_name": "ZeroPadding2D", "config": {"name": "98", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "99", "class_name": "Conv2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["98", 0, 0, {}]]]}, {"name": "100", "class_name": "Activation", "config": {"name": "100", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["99", 0, 0, {}]]]}, {"name": "104", "class_name": "ZeroPadding2D", "config": {"name": "104", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "105", "class_name": "Conv2D", "config": {"name": "105", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["104", 0, 0, {}]]]}, {"name": "106", "class_name": "Activation", "config": {"name": "106", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["105", 0, 0, {}]]]}, {"name": "133", "class_name": "UpSampling2D", "config": {"name": "133", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "inbound_nodes": [[["106", 0, 0, {}]]]}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 48, 160], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "134", "class_name": "Concatenate", "config": {"name": "134", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["133", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "135", "class_name": "ZeroPadding2D", "config": {"name": "135", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["134", 0, 0, {}]]]}, {"name": "136", "class_name": "Conv2D", "config": {"name": "136", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["135", 0, 0, {}]]]}, {"name": "137", "class_name": "Activation", "config": {"name": "137", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["136", 0, 0, {}]]]}, {"name": "141", "class_name": "ZeroPadding2D", "config": {"name": "141", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "142", "class_name": "Conv2D", "config": {"name": "142", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["141", 0, 0, {}]]]}, {"name": "143", "class_name": "Activation", "config": {"name": "143", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["142", 0, 0, {}]]]}, {"name": "170", "class_name": "UpSampling2D", "config": {"name": "170", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 96, 320], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "171", "class_name": "Concatenate", "config": {"name": "171", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["170", 0, 0, {}], ["input_0", 0, 0, {}]]]}, {"name": "172", "class_name": "ZeroPadding2D", "config": {"name": "172", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["171", 0, 0, {}]]]}, {"name": "173", "class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["172", 0, 0, {}]]]}, {"name": "174", "class_name": "Activation", "config": {"name": "174", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["173", 0, 0, {}]]]}, {"name": "178", "class_name": "ZeroPadding2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "179", "class_name": "Conv2D", "config": {"name": "179", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "Activation", "config": {"name": "180", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["179", 0, 0, {}]]]}, {"name": "207", "class_name": "UpSampling2D", "config": {"name": "207", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "inbound_nodes": [[["180", 0, 0, {}]]]}, {"name": "209", "class_name": "ZeroPadding2D", "config": {"name": "209", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["207", 0, 0, {}]]]}, {"name": "210", "class_name": "Conv2D", "config": {"name": "210", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["209", 0, 0, {}]]]}, {"name": "211", "class_name": "Activation", "config": {"name": "211", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["210", 0, 0, {}]]]}, {"name": "101", "class_name": "ZeroPadding2D", "config": {"name": "101", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "138", "class_name": "ZeroPadding2D", "config": {"name": "138", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "175", "class_name": "ZeroPadding2D", "config": {"name": "175", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "212", "class_name": "ZeroPadding2D", "config": {"name": "212", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["211", 0, 0, {}]]]}, {"name": "102", "class_name": "Conv2D", "config": {"name": "102", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["101", 0, 0, {}]]]}, {"name": "139", "class_name": "Conv2D", "config": {"name": "139", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["138", 0, 0, {}]]]}, {"name": "176", "class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "213", "class_name": "Conv2D", "config": {"name": "213", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["212", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["102", 0, 0, {}]]]}, {"name": "output_1", "class_name": "Activation", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["139", 0, 0, {}]]]}, {"name": "output_2", "class_name": "Activation", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "output_3", "class_name": "Activation", "config": {"name": "output_3", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["213", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0], ["output_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "102/kernel", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"min": -0.03223292151210355, "scale": 0.00026638778109176487, "dtype": "uint8"}}, {"name": "102/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.023330381140112877, "scale": 1.0, "dtype": "uint8"}}, {"name": "105/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"min": -0.17495577890498965, "scale": 0.0013355402969846537, "dtype": "uint8"}}, {"name": "105/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.04181856092284707, "scale": 0.0002751221113345202, "dtype": "uint8"}}, {"name": "136/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"min": -0.1449587378431769, "scale": 0.0011414073845919441, "dtype": "uint8"}}, {"name": "136/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0562392161172979, "scale": 0.0003605077956237045, "dtype": "uint8"}}, {"name": "139/kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"min": -0.04067453461534837, "scale": 0.0003567941632925295, "dtype": "uint8"}}, {"name": "139/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.020105529576539993, "scale": 1.0, "dtype": "uint8"}}, {"name": "142/kernel", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"min": -0.19993978014179303, "scale": 0.001562029532357758, "dtype": "uint8"}}, {"name": "142/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.053518778903811584, "scale": 0.0003520972296303394, "dtype": "uint8"}}, {"name": "173/kernel", "shape": [3, 3, 96, 32], "dtype": "float32", "quantization": {"min": -0.2298816004220177, "scale": 0.0016658086987102732, "dtype": "uint8"}}, {"name": "173/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.06540225691655102, "scale": 0.00038699560305651494, "dtype": "uint8"}}, {"name": "176/kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -0.05788352559594547, "scale": 0.0004823627132995456, "dtype": "uint8"}}, {"name": "176/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.0007096360204741359, "scale": 1.0, "dtype": "uint8"}}, {"name": "179/kernel", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"min": -0.2044533681051404, "scale": 0.0014923603511324116, "dtype": "uint8"}}, {"name": "179/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.0697248062374545, "scale": 0.0005242466634395076, "dtype": "uint8"}}, {"name": "210/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -0.19110852479934692, "scale": 0.0016474872827529907, "dtype": "uint8"}}, {"name": "210/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.0801658924888162, "scale": 0.0005567075867278903, "dtype": "uint8"}}, {"name": "213/kernel", "shape": [3, 3, 16, 1], "dtype": "float32", "quantization": {"min": -0.086222984159694, "scale": 0.0007067457718007705, "dtype": "uint8"}}, {"name": "213/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.024761416018009186, "scale": 1.0, "dtype": "uint8"}}, {"name": "34/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"min": -0.23046670854091644, "scale": 0.001506318356476578, "dtype": "uint8"}}, {"name": "34/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.0248734712600708, "scale": 0.0002590986589590708, "dtype": "uint8"}}, {"name": "65/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"min": -0.4036148348275353, "scale": 0.0027835505850174846, "dtype": "uint8"}}, {"name": "65/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.0413239611312747, "scale": 0.00022098374936510535, "dtype": "uint8"}}, {"name": "68/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"min": -0.20446940496856092, "scale": 0.0012779337810535057, "dtype": "uint8"}}, {"name": "68/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.05635017014163382, "scale": 0.00028897523149555804, "dtype": "uint8"}}, {"name": "99/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"min": -0.3491791318444645, "scale": 0.0020784472133599076, "dtype": "uint8"}}, {"name": "99/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.09409121011986453, "scale": 0.000547041919301538, "dtype": "uint8"}}]}]}