{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "33", "class_name": "ZeroPadding2D", "config": {"name": "33", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "34", "class_name": "Conv2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["33", 0, 0, {}]]]}, {"name": "35", "class_name": "ELU", "config": {"name": "35", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["34", 0, 0, {}]]]}, {"name": "62", "class_name": "UpSampling2D", "config": {"name": "62", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["35", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "63", "class_name": "Concatenate", "config": {"name": "63", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["62", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "64", "class_name": "ZeroPadding2D", "config": {"name": "64", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["63", 0, 0, {}]]]}, {"name": "65", "class_name": "Conv2D", "config": {"name": "65", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["64", 0, 0, {}]]]}, {"name": "66", "class_name": "ELU", "config": {"name": "66", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["65", 0, 0, {}]]]}, {"name": "67", "class_name": "ZeroPadding2D", "config": {"name": "67", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["66", 0, 0, {}]]]}, {"name": "68", "class_name": "Conv2D", "config": {"name": "68", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["67", 0, 0, {}]]]}, {"name": "69", "class_name": "ELU", "config": {"name": "69", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["68", 0, 0, {}]]]}, {"name": "96", "class_name": "UpSampling2D", "config": {"name": "96", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["69", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "97", "class_name": "Concatenate", "config": {"name": "97", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["96", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "98", "class_name": "ZeroPadding2D", "config": {"name": "98", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "99", "class_name": "Conv2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["98", 0, 0, {}]]]}, {"name": "100", "class_name": "ELU", "config": {"name": "100", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["99", 0, 0, {}]]]}, {"name": "104", "class_name": "ZeroPadding2D", "config": {"name": "104", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "105", "class_name": "Conv2D", "config": {"name": "105", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["104", 0, 0, {}]]]}, {"name": "106", "class_name": "ELU", "config": {"name": "106", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["105", 0, 0, {}]]]}, {"name": "133", "class_name": "UpSampling2D", "config": {"name": "133", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["106", 0, 0, {}]]]}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "134", "class_name": "Concatenate", "config": {"name": "134", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["133", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "135", "class_name": "ZeroPadding2D", "config": {"name": "135", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["134", 0, 0, {}]]]}, {"name": "136", "class_name": "Conv2D", "config": {"name": "136", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["135", 0, 0, {}]]]}, {"name": "137", "class_name": "ELU", "config": {"name": "137", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["136", 0, 0, {}]]]}, {"name": "141", "class_name": "ZeroPadding2D", "config": {"name": "141", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "142", "class_name": "Conv2D", "config": {"name": "142", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["141", 0, 0, {}]]]}, {"name": "143", "class_name": "ELU", "config": {"name": "143", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["142", 0, 0, {}]]]}, {"name": "170", "class_name": "UpSampling2D", "config": {"name": "170", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "171", "class_name": "Concatenate", "config": {"name": "171", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["170", 0, 0, {}], ["input_0", 0, 0, {}]]]}, {"name": "172", "class_name": "ZeroPadding2D", "config": {"name": "172", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["171", 0, 0, {}]]]}, {"name": "173", "class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["172", 0, 0, {}]]]}, {"name": "174", "class_name": "ELU", "config": {"name": "174", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["173", 0, 0, {}]]]}, {"name": "178", "class_name": "ZeroPadding2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "179", "class_name": "Conv2D", "config": {"name": "179", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "ELU", "config": {"name": "180", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["179", 0, 0, {}]]]}, {"name": "207", "class_name": "UpSampling2D", "config": {"name": "207", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["180", 0, 0, {}]]]}, {"name": "209", "class_name": "ZeroPadding2D", "config": {"name": "209", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["207", 0, 0, {}]]]}, {"name": "210", "class_name": "Conv2D", "config": {"name": "210", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["209", 0, 0, {}]]]}, {"name": "211", "class_name": "ELU", "config": {"name": "211", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["210", 0, 0, {}]]]}, {"name": "212", "class_name": "ZeroPadding2D", "config": {"name": "212", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["211", 0, 0, {}]]]}, {"name": "175", "class_name": "ZeroPadding2D", "config": {"name": "175", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "138", "class_name": "ZeroPadding2D", "config": {"name": "138", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "101", "class_name": "ZeroPadding2D", "config": {"name": "101", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "213", "class_name": "Conv2D", "config": {"name": "213", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["212", 0, 0, {}]]]}, {"name": "176", "class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "139", "class_name": "Conv2D", "config": {"name": "139", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["138", 0, 0, {}]]]}, {"name": "102", "class_name": "Conv2D", "config": {"name": "102", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["101", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["213", 0, 0, {}]]]}, {"name": "output_1", "class_name": "Activation", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "output_2", "class_name": "Activation", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["139", 0, 0, {}]]]}, {"name": "output_3", "class_name": "Activation", "config": {"name": "output_3", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["102", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0], ["output_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "102/kernel", "shape": [3, 3, 128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.025733073479404636, "scale": 0.00036761533542006624, "original_dtype": "float32"}}, {"name": "102/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.048575516790151596, "scale": 1.0, "original_dtype": "float32"}}, {"name": "105/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3753392415888169, "scale": 0.0025360759566811952, "original_dtype": "float32"}}, {"name": "105/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1635886028409004, "scale": 0.0008748053627855637, "original_dtype": "float32"}}, {"name": "136/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2737519081901102, "scale": 0.0024013325279834226, "original_dtype": "float32"}}, {"name": "136/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31629650408730786, "scale": 0.0014849601130859525, "original_dtype": "float32"}}, {"name": "139/kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03756635212430767, "scale": 0.00034151229203916063, "original_dtype": "float32"}}, {"name": "139/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.011838171631097794, "scale": 1.0, "original_dtype": "float32"}}, {"name": "142/kernel", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3345085837093054, "scale": 0.002339220865100038, "original_dtype": "float32"}}, {"name": "142/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16279472807312714, "scale": 0.0007433549227083431, "original_dtype": "float32"}}, {"name": "173/kernel", "shape": [3, 3, 96, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5250928178721783, "scale": 0.0040083421211616664, "original_dtype": "float32"}}, {"name": "173/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08958940186044749, "scale": 0.0005429660718815, "original_dtype": "float32"}}, {"name": "176/kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06480174695744234, "scale": 0.0006230937207446379, "original_dtype": "float32"}}, {"name": "176/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.004728726111352444, "scale": 1.0, "original_dtype": "float32"}}, {"name": "179/kernel", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3235053181648255, "scale": 0.003335106372833252, "original_dtype": "float32"}}, {"name": "179/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10070772498261696, "scale": 0.0006669385760438209, "original_dtype": "float32"}}, {"name": "210/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3048328136696535, "scale": 0.0026054086638431923, "original_dtype": "float32"}}, {"name": "210/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11933438792532565, "scale": 0.001094810898397483, "original_dtype": "float32"}}, {"name": "213/kernel", "shape": [3, 3, 16, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10874593345557944, "scale": 0.0009885993950507221, "original_dtype": "float32"}}, {"name": "213/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05781269446015358, "scale": 1.0, "original_dtype": "float32"}}, {"name": "34/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.46665986320551706, "scale": 0.0030107087948743035, "original_dtype": "float32"}}, {"name": "34/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07158762216567993, "scale": 0.0006628483533859253, "original_dtype": "float32"}}, {"name": "65/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8111376404762268, "scale": 0.006287888685862223, "original_dtype": "float32"}}, {"name": "65/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07189046134259186, "scale": 0.0003705693883638756, "original_dtype": "float32"}}, {"name": "68/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.36798648097935843, "scale": 0.0025378377998576443, "original_dtype": "float32"}}, {"name": "68/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11447132755728329, "scale": 0.0005503429209484773, "original_dtype": "float32"}}, {"name": "99/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8431093365538355, "scale": 0.0052694333534614715, "original_dtype": "float32"}}, {"name": "99/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2022413564078948, "scale": 0.0010873191204725527, "original_dtype": "float32"}}]}]}
