{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "123_pad", "class_name": "ZeroPadding2D", "config": {"name": "123_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "123", "class_name": "Conv2D", "config": {"name": "123", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["123_pad", 0, 0, {}]]]}, {"name": "124", "class_name": "BatchNormalization", "config": {"name": "124", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["123", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["124", 0, 0, {}]]]}, {"name": "126_pad", "class_name": "ZeroPadding2D", "config": {"name": "126_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"name": "126", "class_name": "MaxPooling2D", "config": {"name": "126", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["126_pad", 0, 0, {}]]]}, {"name": "127_pad", "class_name": "ZeroPadding2D", "config": {"name": "127_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["126", 0, 0, {}]]]}, {"name": "127", "class_name": "Conv2D", "config": {"name": "127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["127_pad", 0, 0, {}]]]}, {"name": "128", "class_name": "BatchNormalization", "config": {"name": "128", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["127", 0, 0, {}]]]}, {"name": "129", "class_name": "Activation", "config": {"name": "129", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["128", 0, 0, {}]]]}, {"name": "130_pad", "class_name": "ZeroPadding2D", "config": {"name": "130_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "130", "class_name": "Conv2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["130_pad", 0, 0, {}]]]}, {"name": "131", "class_name": "BatchNormalization", "config": {"name": "131", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "132", "class_name": "Add", "config": {"name": "132", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["131", 0, 0, {}], ["126", 0, 0, {}]]]}, {"name": "133", "class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["132", 0, 0, {}]]]}, {"name": "134_pad", "class_name": "ZeroPadding2D", "config": {"name": "134_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["133", 0, 0, {}]]]}, {"name": "134", "class_name": "Conv2D", "config": {"name": "134", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["134_pad", 0, 0, {}]]]}, {"name": "135", "class_name": "BatchNormalization", "config": {"name": "135", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["134", 0, 0, {}]]]}, {"name": "136", "class_name": "Activation", "config": {"name": "136", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["135", 0, 0, {}]]]}, {"name": "137_pad", "class_name": "ZeroPadding2D", "config": {"name": "137_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["136", 0, 0, {}]]]}, {"name": "137", "class_name": "Conv2D", "config": {"name": "137", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["137_pad", 0, 0, {}]]]}, {"name": "138", "class_name": "BatchNormalization", "config": {"name": "138", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "139", "class_name": "Add", "config": {"name": "139", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["138", 0, 0, {}], ["133", 0, 0, {}]]]}, {"name": "output_1", "class_name": "Activation", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["139", 0, 0, {}]]]}, {"name": "141_pad", "class_name": "ZeroPadding2D", "config": {"name": "141_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "141", "class_name": "Conv2D", "config": {"name": "141", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["141_pad", 0, 0, {}]]]}, {"name": "142", "class_name": "BatchNormalization", "config": {"name": "142", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["141", 0, 0, {}]]]}, {"name": "143", "class_name": "Activation", "config": {"name": "143", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["142", 0, 0, {}]]]}, {"name": "144_pad", "class_name": "ZeroPadding2D", "config": {"name": "144_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "144", "class_name": "Conv2D", "config": {"name": "144", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["144_pad", 0, 0, {}]]]}, {"name": "146", "class_name": "Conv2D", "config": {"name": "146", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "145", "class_name": "BatchNormalization", "config": {"name": "145", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["144", 0, 0, {}]]]}, {"name": "147", "class_name": "BatchNormalization", "config": {"name": "147", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["146", 0, 0, {}]]]}, {"name": "148", "class_name": "Add", "config": {"name": "148", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["145", 0, 0, {}], ["147", 0, 0, {}]]]}, {"name": "149", "class_name": "Activation", "config": {"name": "149", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["148", 0, 0, {}]]]}, {"name": "150_pad", "class_name": "ZeroPadding2D", "config": {"name": "150_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["149", 0, 0, {}]]]}, {"name": "150", "class_name": "Conv2D", "config": {"name": "150", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["150_pad", 0, 0, {}]]]}, {"name": "151", "class_name": "BatchNormalization", "config": {"name": "151", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["150", 0, 0, {}]]]}, {"name": "152", "class_name": "Activation", "config": {"name": "152", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["151", 0, 0, {}]]]}, {"name": "153_pad", "class_name": "ZeroPadding2D", "config": {"name": "153_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["152", 0, 0, {}]]]}, {"name": "153", "class_name": "Conv2D", "config": {"name": "153", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["153_pad", 0, 0, {}]]]}, {"name": "154", "class_name": "BatchNormalization", "config": {"name": "154", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["153", 0, 0, {}]]]}, {"name": "155", "class_name": "Add", "config": {"name": "155", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["154", 0, 0, {}], ["149", 0, 0, {}]]]}, {"name": "output_2", "class_name": "Activation", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["155", 0, 0, {}]]]}, {"name": "157_pad", "class_name": "ZeroPadding2D", "config": {"name": "157_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "157", "class_name": "Conv2D", "config": {"name": "157", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["157_pad", 0, 0, {}]]]}, {"name": "158", "class_name": "BatchNormalization", "config": {"name": "158", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["157", 0, 0, {}]]]}, {"name": "159", "class_name": "Activation", "config": {"name": "159", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["158", 0, 0, {}]]]}, {"name": "160_pad", "class_name": "ZeroPadding2D", "config": {"name": "160_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["159", 0, 0, {}]]]}, {"name": "160", "class_name": "Conv2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["160_pad", 0, 0, {}]]]}, {"name": "162", "class_name": "Conv2D", "config": {"name": "162", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "161", "class_name": "BatchNormalization", "config": {"name": "161", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["160", 0, 0, {}]]]}, {"name": "163", "class_name": "BatchNormalization", "config": {"name": "163", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Add", "config": {"name": "164", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["161", 0, 0, {}], ["163", 0, 0, {}]]]}, {"name": "165", "class_name": "Activation", "config": {"name": "165", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["164", 0, 0, {}]]]}, {"name": "166_pad", "class_name": "ZeroPadding2D", "config": {"name": "166_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["165", 0, 0, {}]]]}, {"name": "166", "class_name": "Conv2D", "config": {"name": "166", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["166_pad", 0, 0, {}]]]}, {"name": "167", "class_name": "BatchNormalization", "config": {"name": "167", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["166", 0, 0, {}]]]}, {"name": "168", "class_name": "Activation", "config": {"name": "168", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["167", 0, 0, {}]]]}, {"name": "169_pad", "class_name": "ZeroPadding2D", "config": {"name": "169_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["168", 0, 0, {}]]]}, {"name": "169", "class_name": "Conv2D", "config": {"name": "169", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["169_pad", 0, 0, {}]]]}, {"name": "170", "class_name": "BatchNormalization", "config": {"name": "170", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["169", 0, 0, {}]]]}, {"name": "171", "class_name": "Add", "config": {"name": "171", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["170", 0, 0, {}], ["165", 0, 0, {}]]]}, {"name": "output_3", "class_name": "Activation", "config": {"name": "output_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["171", 0, 0, {}]]]}, {"name": "173_pad", "class_name": "ZeroPadding2D", "config": {"name": "173_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "173", "class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["173_pad", 0, 0, {}]]]}, {"name": "174", "class_name": "BatchNormalization", "config": {"name": "174", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["173", 0, 0, {}]]]}, {"name": "175", "class_name": "Activation", "config": {"name": "175", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "176_pad", "class_name": "ZeroPadding2D", "config": {"name": "176_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "176", "class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["176_pad", 0, 0, {}]]]}, {"name": "178", "class_name": "Conv2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "177", "class_name": "BatchNormalization", "config": {"name": "177", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "179", "class_name": "BatchNormalization", "config": {"name": "179", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "Add", "config": {"name": "180", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["177", 0, 0, {}], ["179", 0, 0, {}]]]}, {"name": "181", "class_name": "Activation", "config": {"name": "181", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["180", 0, 0, {}]]]}, {"name": "182_pad", "class_name": "ZeroPadding2D", "config": {"name": "182_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["181", 0, 0, {}]]]}, {"name": "182", "class_name": "Conv2D", "config": {"name": "182", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["182_pad", 0, 0, {}]]]}, {"name": "183", "class_name": "BatchNormalization", "config": {"name": "183", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["182", 0, 0, {}]]]}, {"name": "184", "class_name": "Activation", "config": {"name": "184", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["183", 0, 0, {}]]]}, {"name": "185_pad", "class_name": "ZeroPadding2D", "config": {"name": "185_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["184", 0, 0, {}]]]}, {"name": "185", "class_name": "Conv2D", "config": {"name": "185", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["185_pad", 0, 0, {}]]]}, {"name": "186", "class_name": "BatchNormalization", "config": {"name": "186", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["185", 0, 0, {}]]]}, {"name": "187", "class_name": "Add", "config": {"name": "187", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["186", 0, 0, {}], ["181", 0, 0, {}]]]}, {"name": "output_4", "class_name": "Activation", "config": {"name": "output_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["187", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0], ["output_3", 0, 0], ["output_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "123/kernel", "shape": [7, 7, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8623114165137795, "scale": 0.007370183047126321, "original_dtype": "float32"}}, {"name": "124/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.0025385531390994085, "original_dtype": "float32"}}, {"name": "124/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6733619540345435, "scale": 0.005260640265894871, "original_dtype": "float32"}}, {"name": "124/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.947975353166169, "scale": 0.019785069484336705, "original_dtype": "float32"}}, {"name": "124/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0816874333090601e-13, "scale": 0.1580791248994711, "original_dtype": "float32"}}, {"name": "127/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.086550132901061, "scale": 0.00679093833063163, "original_dtype": "float32"}}, {"name": "128/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.16485296189785004, "scale": 0.0021028816115622427, "original_dtype": "float32"}}, {"name": "128/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5448720402577344, "scale": 0.0035153034855337703, "original_dtype": "float32"}}, {"name": "128/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.5369634067311004, "scale": 0.01838379280239928, "original_dtype": "float32"}}, {"name": "128/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.08922293782234192, "scale": 0.010443512481801651, "original_dtype": "float32"}}, {"name": "130/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.595863524605246, "scale": 0.004413803885964786, "original_dtype": "float32"}}, {"name": "131/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.08697114139795303, "scale": 0.0019206337776838565, "original_dtype": "float32"}}, {"name": "131/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.42148509937174183, "scale": 0.003318780310013715, "original_dtype": "float32"}}, {"name": "131/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.092993402481079, "scale": 0.009587661425272623, "original_dtype": "float32"}}, {"name": "131/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.06942186504602432, "scale": 0.003865438904248032, "original_dtype": "float32"}}, {"name": "134/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6595653318891338, "scale": 0.005319075257170434, "original_dtype": "float32"}}, {"name": "135/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1514422595500946, "scale": 0.0013344913136725332, "original_dtype": "float32"}}, {"name": "135/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5380631106741288, "scale": 0.0030746463467093074, "original_dtype": "float32"}}, {"name": "135/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.1363357366300098, "scale": 0.021932417738671398, "original_dtype": "float32"}}, {"name": "135/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.23597462475299835, "scale": 0.005382717064782685, "original_dtype": "float32"}}, {"name": "137/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.48534561255398917, "scale": 0.0035169971924202113, "original_dtype": "float32"}}, {"name": "138/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.03843587264418602, "scale": 0.0024822992583115894, "original_dtype": "float32"}}, {"name": "138/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4866816319671332, "scale": 0.002967570926628861, "original_dtype": "float32"}}, {"name": "138/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7759625911712646, "scale": 0.007607476384032006, "original_dtype": "float32"}}, {"name": "138/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.07613743841648102, "scale": 0.0014553237779467714, "original_dtype": "float32"}}, {"name": "141/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.47828411822225536, "scale": 0.0035961211896410176, "original_dtype": "float32"}}, {"name": "142/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.14834728837013245, "scale": 0.0008864641189575195, "original_dtype": "float32"}}, {"name": "142/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.35223930513157564, "scale": 0.0036313330425935633, "original_dtype": "float32"}}, {"name": "142/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.8762069003254758, "scale": 0.01084512659147674, "original_dtype": "float32"}}, {"name": "142/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5000655651092529, "scale": 0.007972758424048331, "original_dtype": "float32"}}, {"name": "144/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5147544881876778, "scale": 0.004254169323865105, "original_dtype": "float32"}}, {"name": "145/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0806727185845375, "scale": 0.0022926670371317395, "original_dtype": "float32"}}, {"name": "145/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3137044521523457, "scale": 0.0018784697733673396, "original_dtype": "float32"}}, {"name": "145/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.113579565403508, "scale": 0.010112820887098126, "original_dtype": "float32"}}, {"name": "145/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1282912641763687, "scale": 0.0023783498534969256, "original_dtype": "float32"}}, {"name": "146/kernel", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.83480003230712, "scale": 0.0068991738207199995, "original_dtype": "float32"}}, {"name": "147/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0012848328333348036, "scale": 0.0019294674681755257, "original_dtype": "float32"}}, {"name": "147/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3137044521523457, "scale": 0.0018784697733673396, "original_dtype": "float32"}}, {"name": "147/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7924040462456498, "scale": 0.007203673147687725, "original_dtype": "float32"}}, {"name": "147/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.03298165276646614, "scale": 0.0007618229617090786, "original_dtype": "float32"}}, {"name": "150/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.521424020505419, "scale": 0.004205032423430798, "original_dtype": "float32"}}, {"name": "151/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1843729019165039, "scale": 0.0010386208693186443, "original_dtype": "float32"}}, {"name": "151/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6487065553665161, "scale": 0.0021792226854492635, "original_dtype": "float32"}}, {"name": "151/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.5620180158054127, "scale": 0.021587987974578258, "original_dtype": "float32"}}, {"name": "151/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5073223114013672, "scale": 0.004400358480565688, "original_dtype": "float32"}}, {"name": "153/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3744196540000392, "scale": 0.0033134482654870725, "original_dtype": "float32"}}, {"name": "154/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.03843073174357414, "scale": 0.0027458051402194828, "original_dtype": "float32"}}, {"name": "154/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5818061091736251, "scale": 0.0029236487898172117, "original_dtype": "float32"}}, {"name": "154/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7837778248038946, "scale": 0.005638689387078379, "original_dtype": "float32"}}, {"name": "154/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.07664018124341965, "scale": 0.0005538378568256603, "original_dtype": "float32"}}, {"name": "157/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6741609755684348, "scale": 0.005031052056480857, "original_dtype": "float32"}}, {"name": "158/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1679488569498062, "scale": 0.0012822559651206522, "original_dtype": "float32"}}, {"name": "158/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4614458771312938, "scale": 0.0027467016495910344, "original_dtype": "float32"}}, {"name": "158/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.955909652335971, "scale": 0.018359687281589883, "original_dtype": "float32"}}, {"name": "158/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6764006018638611, "scale": 0.007858745023316028, "original_dtype": "float32"}}, {"name": "160/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5219355996917275, "scale": 0.003782142026751649, "original_dtype": "float32"}}, {"name": "161/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.22616015374660492, "scale": 0.0019433650900335872, "original_dtype": "float32"}}, {"name": "161/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3793957113635306, "scale": 0.0021679754935058893, "original_dtype": "float32"}}, {"name": "161/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.6710648221128126, "scale": 0.009772308901244519, "original_dtype": "float32"}}, {"name": "161/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.2900937795639038, "scale": 0.006462201417661181, "original_dtype": "float32"}}, {"name": "162/kernel", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4657598085263196, "scale": 0.003501953447566313, "original_dtype": "float32"}}, {"name": "163/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.001942757167853415, "scale": 0.0011350643268658541, "original_dtype": "float32"}}, {"name": "163/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3793957113635306, "scale": 0.0021679754935058893, "original_dtype": "float32"}}, {"name": "163/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3546426068334018, "scale": 0.0026269822728400135, "original_dtype": "float32"}}, {"name": "163/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.028004344552755356, "scale": 0.00023325592571613835, "original_dtype": "float32"}}, {"name": "166/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4698118427220513, "scale": 0.003285397501552806, "original_dtype": "float32"}}, {"name": "167/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.14783084392547607, "scale": 0.0011833388431399475, "original_dtype": "float32"}}, {"name": "167/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6433041707557791, "scale": 0.0030060942558681266, "original_dtype": "float32"}}, {"name": "167/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -5.024143144196156, "scale": 0.03241382673674939, "original_dtype": "float32"}}, {"name": "167/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0427238941192627, "scale": 0.013150176814958161, "original_dtype": "float32"}}, {"name": "169/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.42668742853052477, "scale": 0.0030919378879023535, "original_dtype": "float32"}}, {"name": "170/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.008117740973830223, "scale": 0.002571964943233658, "original_dtype": "float32"}}, {"name": "170/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7269786357879638, "scale": 0.0033656418323516845, "original_dtype": "float32"}}, {"name": "170/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8498222713376962, "scale": 0.007520551073784922, "original_dtype": "float32"}}, {"name": "170/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.06870923936367035, "scale": 0.0008558261043885175, "original_dtype": "float32"}}, {"name": "173/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3548149730644974, "scale": 