{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 320, 56, 56], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "33", "class_name": "ZeroPadding2D", "config": {"name": "33", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "65", "class_name": "ZeroPadding2D", "config": {"name": "65", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "97", "class_name": "ZeroPadding2D", "config": {"name": "97", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "129", "class_name": "ZeroPadding2D", "config": {"name": "129", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "34", "class_name": "AveragePooling2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "inbound_nodes": [[["33", 0, 0, {}]]]}, {"name": "66", "class_name": "AveragePooling2D", "config": {"name": "66", "trainable": true, "dtype": "float32", "pool_size": [28, 28], "padding": "valid", "strides": [28, 28], "data_format": "channels_first"}, "inbound_nodes": [[["65", 0, 0, {}]]]}, {"name": "98", "class_name": "AveragePooling2D", "config": {"name": "98", "trainable": true, "dtype": "float32", "pool_size": [14, 14], "padding": "valid", "strides": [14, 14], "data_format": "channels_first"}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "130", "class_name": "AveragePooling2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "pool_size": [7, 7], "padding": "valid", "strides": [7, 7], "data_format": "channels_first"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "35", "class_name": "Conv2D", "config": {"name": "35", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["34", 0, 0, {}]]]}, {"name": "67", "class_name": "Conv2D", "config": {"name": "67", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["66", 0, 0, {}]]]}, {"name": "99", "class_name": "Conv2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["98", 0, 0, {}]]]}, {"name": "131", "class_name": "Conv2D", "config": {"name": "131", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "36", "class_name": "BatchNormalization", "config": {"name": "36", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["35", 0, 0, {}]]]}, {"name": "68", "class_name": "BatchNormalization", "config": {"name": "68", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["67", 0, 0, {}]]]}, {"name": "100", "class_name": "BatchNormalization", "config": {"name": "100", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["99", 0, 0, {}]]]}, {"name": "132", "class_name": "BatchNormalization", "config": {"name": "132", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["131", 0, 0, {}]]]}, {"name": "37", "class_name": "Activation", "config": {"name": "37", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["36", 0, 0, {}]]]}, {"name": "69", "class_name": "Activation", "config": {"name": "69", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["68", 0, 0, {}]]]}, {"name": "101", "class_name": "Activation", "config": {"name": "101", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "133", "class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["132", 0, 0, {}]]]}, {"name": "64", "class_name": "UpSampling2D", "config": {"name": "64", "trainable": true, "dtype": "float32", "size": [56, 56], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["37", 0, 0, {}]]]}, {"name": "96", "class_name": "UpSampling2D", "config": {"name": "96", "trainable": true, "dtype": "float32", "size": [28, 28], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["69", 0, 0, {}]]]}, {"name": "128", "class_name": "UpSampling2D", "config": {"name": "128", "trainable": true, "dtype": "float32", "size": [14, 14], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["101", 0, 0, {}]]]}, {"name": "160", "class_name": "UpSampling2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "size": [7, 7], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["133", 0, 0, {}]]]}, {"name": "161", "class_name": "Concatenate", "config": {"name": "161", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["input_0", 0, 0, {}], ["64", 0, 0, {}], ["96", 0, 0, {}], ["128", 0, 0, {}], ["160", 0, 0, {}]]]}, {"name": "162_pad", "class_name": "ZeroPadding2D", "config": {"name": "162_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["161", 0, 0, {}]]]}, {"name": "162", "class_name": "Conv2D", "config": {"name": "162", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["162_pad", 0, 0, {}]]]}, {"name": "163", "class_name": "BatchNormalization", "config": {"name": "163", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Activation", "config": {"name": "164", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["163", 0, 0, {}]]]}, {"name": "165", "class_name": "Conv2D", "config": {"name": "165", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["164", 0, 0, {}]]]}, {"name": "output_0", "class_name": "UpSampling2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "size": [8, 8], "data_format": "channels_first", "interpolation": "bilinear"}, "inbound_nodes": [[["165", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "100/gamma", "shape": [80], "dtype": "float32"}, {"name": "100/beta", "shape": [80], "dtype": "float32"}, {"name": "100/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "100/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "131/kernel", "shape": [1, 1, 320, 80], "dtype": "float32"}, {"name": "132/gamma", "shape": [80], "dtype": "float32"}, {"name": "132/beta", "shape": [80], "dtype": "float32"}, {"name": "132/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "132/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "162/kernel", "shape": [3, 3, 640, 80], "dtype": "float32"}, {"name": "163/gamma", "shape": [80], "dtype": "float32"}, {"name": "163/beta", "shape": [80], "dtype": "float32"}, {"name": "163/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "163/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "165/kernel", "shape": [1, 1, 80, 2], "dtype": "float32"}, {"name": "165/bias", "shape": [2], "dtype": "float32"}, {"name": "35/kernel", "shape": [1, 1, 320, 80], "dtype": "float32"}, {"name": "36/gamma", "shape": [80], "dtype": "float32"}, {"name": "36/beta", "shape": [80], "dtype": "float32"}, {"name": "36/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "36/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "67/kernel", "shape": [1, 1, 320, 80], "dtype": "float32"}, {"name": "68/gamma", "shape": [80], "dtype": "float32"}, {"name": "68/beta", "shape": [80], "dtype": "float32"}, {"name": "68/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "68/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "99/kernel", "shape": [1, 1, 320, 80], "dtype": "float32"}]}]}
