{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "27", "class_name": "ZeroPadding2D", "config": {"name": "27", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "28", "class_name": "Conv2D", "config": {"name": "28", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["27", 0, 0, {}]]]}, {"name": "29", "class_name": "ELU", "config": {"name": "29", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["28", 0, 0, {}]]]}, {"name": "56", "class_name": "UpSampling2D", "config": {"name": "56", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["29", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "57", "class_name": "Concatenate", "config": {"name": "57", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["56", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "58", "class_name": "ZeroPadding2D", "config": {"name": "58", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["57", 0, 0, {}]]]}, {"name": "59", "class_name": "Conv2D", "config": {"name": "59", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["58", 0, 0, {}]]]}, {"name": "60", "class_name": "ELU", "config": {"name": "60", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["59", 0, 0, {}]]]}, {"name": "61", "class_name": "ZeroPadding2D", "config": {"name": "61", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["60", 0, 0, {}]]]}, {"name": "62", "class_name": "Conv2D", "config": {"name": "62", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["61", 0, 0, {}]]]}, {"name": "63", "class_name": "ELU", "config": {"name": "63", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["62", 0, 0, {}]]]}, {"name": "90", "class_name": "UpSampling2D", "config": {"name": "90", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["63", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "91", "class_name": "Concatenate", "config": {"name": "91", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["90", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "92", "class_name": "ZeroPadding2D", "config": {"name": "92", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["91", 0, 0, {}]]]}, {"name": "93", "class_name": "Conv2D", "config": {"name": "93", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["92", 0, 0, {}]]]}, {"name": "94", "class_name": "ELU", "config": {"name": "94", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["93", 0, 0, {}]]]}, {"name": "95", "class_name": "ZeroPadding2D", "config": {"name": "95", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["94", 0, 0, {}]]]}, {"name": "96", "class_name": "Conv2D", "config": {"name": "96", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["95", 0, 0, {}]]]}, {"name": "97", "class_name": "ELU", "config": {"name": "97", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["96", 0, 0, {}]]]}, {"name": "124", "class_name": "UpSampling2D", "config": {"name": "124", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "125", "class_name": "Concatenate", "config": {"name": "125", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["124", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "126", "class_name": "ZeroPadding2D", "config": {"name": "126", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["125", 0, 0, {}]]]}, {"name": "127", "class_name": "Conv2D", "config": {"name": "127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["126", 0, 0, {}]]]}, {"name": "128", "class_name": "ELU", "config": {"name": "128", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["127", 0, 0, {}]]]}, {"name": "129", "class_name": "ZeroPadding2D", "config": {"name": "129", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["128", 0, 0, {}]]]}, {"name": "130", "class_name": "Conv2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "131", "class_name": "ELU", "config": {"name": "131", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "158", "class_name": "UpSampling2D", "config": {"name": "158", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["131", 0, 0, {}]]]}, {"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "159", "class_name": "Concatenate", "config": {"name": "159", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["158", 0, 0, {}], ["input_0", 0, 0, {}]]]}, {"name": "160", "class_name": "ZeroPadding2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["159", 0, 0, {}]]]}, {"name": "161", "class_name": "Conv2D", "config": {"name": "161", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["160", 0, 0, {}]]]}, {"name": "162", "class_name": "ELU", "config": {"name": "162", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["161", 0, 0, {}]]]}, {"name": "163", "class_name": "ZeroPadding2D", "config": {"name": "163", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Conv2D", "config": {"name": "164", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["163", 0, 0, {}]]]}, {"name": "165", "class_name": "ELU", "config": {"name": "165", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["164", 0, 0, {}]]]}, {"name": "192", "class_name": "UpSampling2D", "config": {"name": "192", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["165", 0, 0, {}]]]}, {"name": "194", "class_name": "ZeroPadding2D", "config": {"name": "194", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["192", 0, 0, {}]]]}, {"name": "195", "class_name": "Conv2D", "config": {"name": "195", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["194", 0, 0, {}]]]}, {"name": "196", "class_name": "ELU", "config": {"name": "196", "trainable": true, "dtype": "float32", "alpha": 1.0}, "inbound_nodes": [[["195", 0, 0, {}]]]}, {"name": "197", "class_name": "ZeroPadding2D", "config": {"name": "197", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["196", 0, 0, {}]]]}, {"name": "198", "class_name": "Conv2D", "config": {"name": "198", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["197", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["198", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "127/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "127/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "130/kernel", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "130/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "161/kernel", "shape": [3, 3, 96, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "161/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "164/kernel", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "164/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "195/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "195/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "198/kernel", "shape": [3, 3, 16, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "198/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "28/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "28/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "59/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "59/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "62/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "62/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "93/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "93/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "96/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "96/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}
