{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 192, 640], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "123_pad", "class_name": "ZeroPadding2D", "config": {"name": "123_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "123", "class_name": "Conv2D", "config": {"name": "123", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["123_pad", 0, 0, {}]]]}, {"name": "124", "class_name": "BatchNormalization", "config": {"name": "124", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["123", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["124", 0, 0, {}]]]}, {"name": "126_pad", "class_name": "ZeroPadding2D", "config": {"name": "126_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"name": "126", "class_name": "MaxPooling2D", "config": {"name": "126", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["126_pad", 0, 0, {}]]]}, {"name": "127_pad", "class_name": "ZeroPadding2D", "config": {"name": "127_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["126", 0, 0, {}]]]}, {"name": "127", "class_name": "Conv2D", "config": {"name": "127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["127_pad", 0, 0, {}]]]}, {"name": "128", "class_name": "BatchNormalization", "config": {"name": "128", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["127", 0, 0, {}]]]}, {"name": "129", "class_name": "Activation", "config": {"name": "129", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["128", 0, 0, {}]]]}, {"name": "130_pad", "class_name": "ZeroPadding2D", "config": {"name": "130_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "130", "class_name": "Conv2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["130_pad", 0, 0, {}]]]}, {"name": "131", "class_name": "BatchNormalization", "config": {"name": "131", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "132", "class_name": "Add", "config": {"name": "132", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["131", 0, 0, {}], ["126", 0, 0, {}]]]}, {"name": "133", "class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["132", 0, 0, {}]]]}, {"name": "134_pad", "class_name": "ZeroPadding2D", "config": {"name": "134_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["133", 0, 0, {}]]]}, {"name": "134", "class_name": "Conv2D", "config": {"name": "134", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["134_pad", 0, 0, {}]]]}, {"name": "135", "class_name": "BatchNormalization", "config": {"name": "135", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["134", 0, 0, {}]]]}, {"name": "136", "class_name": "Activation", "config": {"name": "136", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["135", 0, 0, {}]]]}, {"name": "137_pad", "class_name": "ZeroPadding2D", "config": {"name": "137_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["136", 0, 0, {}]]]}, {"name": "137", "class_name": "Conv2D", "config": {"name": "137", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["137_pad", 0, 0, {}]]]}, {"name": "138", "class_name": "BatchNormalization", "config": {"name": "138", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "139", "class_name": "Add", "config": {"name": "139", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["138", 0, 0, {}], ["133", 0, 0, {}]]]}, {"name": "output_1", "class_name": "Activation", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["139", 0, 0, {}]]]}, {"name": "141_pad", "class_name": "ZeroPadding2D", "config": {"name": "141_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "141", "class_name": "Conv2D", "config": {"name": "141", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["141_pad", 0, 0, {}]]]}, {"name": "142", "class_name": "BatchNormalization", "config": {"name": "142", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["141", 0, 0, {}]]]}, {"name": "143", "class_name": "Activation", "config": {"name": "143", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["142", 0, 0, {}]]]}, {"name": "144_pad", "class_name": "ZeroPadding2D", "config": {"name": "144_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "144", "class_name": "Conv2D", "config": {"name": "144", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["144_pad", 0, 0, {}]]]}, {"name": "146", "class_name": "Conv2D", "config": {"name": "146", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "145", "class_name": "BatchNormalization", "config": {"name": "145", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["144", 0, 0, {}]]]}, {"name": "147", "class_name": "BatchNormalization", "config": {"name": "147", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["146", 0, 0, {}]]]}, {"name": "148", "class_name": "Add", "config": {"name": "148", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["145", 0, 0, {}], ["147", 0, 0, {}]]]}, {"name": "149", "class_name": "Activation", "config": {"name": "149", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["148", 0, 0, {}]]]}, {"name": "150_pad", "class_name": "ZeroPadding2D", "config": {"name": "150_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["149", 0, 0, {}]]]}, {"name": "150", "class_name": "Conv2D", "config": {"name": "150", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["150_pad", 0, 0, {}]]]}, {"name": "151", "class_name": "BatchNormalization", "config": {"name": "151", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["150", 0, 0, {}]]]}, {"name": "152", "class_name": "Activation", "config": {"name": "152", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["151", 0, 0, {}]]]}, {"name": "153_pad", "class_name": "ZeroPadding2D", "config": {"name": "153_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["152", 0, 0, {}]]]}, {"name": "153", "class_name": "Conv2D", "config": {"name": "153", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["153_pad", 0, 0, {}]]]}, {"name": "154", "class_name": "BatchNormalization", "config": {"name": "154", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["153", 0, 0, {}]]]}, {"name": "155", "class_name": "Add", "config": {"name": "155", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["154", 0, 0, {}], ["149", 0, 0, {}]]]}, {"name": "output_2", "class_name": "Activation", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["155", 0, 0, {}]]]}, {"name": "157_pad", "class_name": "ZeroPadding2D", "config": {"name": "157_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "157", "class_name": "Conv2D", "config": {"name": "157", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["157_pad", 0, 0, {}]]]}, {"name": "158", "class_name": "BatchNormalization", "config": {"name": "158", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["157", 0, 0, {}]]]}, {"name": "159", "class_name": "Activation", "config": {"name": "159", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["158", 0, 0, {}]]]}, {"name": "160_pad", "class_name": "ZeroPadding2D", "config": {"name": "160_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["159", 0, 0, {}]]]}, {"name": "160", "class_name": "Conv2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["160_pad", 0, 0, {}]]]}, {"name": "162", "class_name": "Conv2D", "config": {"name": "162", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "161", "class_name": "BatchNormalization", "config": {"name": "161", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["160", 0, 0, {}]]]}, {"name": "163", "class_name": "BatchNormalization", "config": {"name": "163", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Add", "config": {"name": "164", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["161", 0, 0, {}], ["163", 0, 0, {}]]]}, {"name": "165", "class_name": "Activation", "config": {"name": "165", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["164", 0, 0, {}]]]}, {"name": "166_pad", "class_name": "ZeroPadding2D", "config": {"name": "166_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["165", 0, 0, {}]]]}, {"name": "166", "class_name": "Conv2D", "config": {"name": "166", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["166_pad", 0, 0, {}]]]}, {"name": "167", "class_name": "BatchNormalization", "config": {"name": "167", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["166", 0, 0, {}]]]}, {"name": "168", "class_name": "Activation", "config": {"name": "168", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["167", 0, 0, {}]]]}, {"name": "169_pad", "class_name": "ZeroPadding2D", "config": {"name": "169_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["168", 0, 0, {}]]]}, {"name": "169", "class_name": "Conv2D", "config": {"name": "169", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["169_pad", 0, 0, {}]]]}, {"name": "170", "class_name": "BatchNormalization", "config": {"name": "170", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["169", 0, 0, {}]]]}, {"name": "171", "class_name": "Add", "config": {"name": "171", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["170", 0, 0, {}], ["165", 0, 0, {}]]]}, {"name": "output_3", "class_name": "Activation", "config": {"name": "output_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["171", 0, 0, {}]]]}, {"name": "173_pad", "class_name": "ZeroPadding2D", "config": {"name": "173_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "173", "class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["173_pad", 0, 0, {}]]]}, {"name": "174", "class_name": "BatchNormalization", "config": {"name": "174", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["173", 0, 0, {}]]]}, {"name": "175", "class_name": "Activation", "config": {"name": "175", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "176_pad", "class_name": "ZeroPadding2D", "config": {"name": "176_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "176", "class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["176_pad", 0, 0, {}]]]}, {"name": "178", "class_name": "Conv2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "177", "class_name": "BatchNormalization", "config": {"name": "177", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "179", "class_name": "BatchNormalization", "config": {"name": "179", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "Add", "config": {"name": "180", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["177", 0, 0, {}], ["179", 0, 0, {}]]]}, {"name": "181", "class_name": "Activation", "config": {"name": "181", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["180", 0, 0, {}]]]}, {"name": "182_pad", "class_name": "ZeroPadding2D", "config": {"name": "182_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["181", 0, 0, {}]]]}, {"name": "182", "class_name": "Conv2D", "config": {"name": "182", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["182_pad", 0, 0, {}]]]}, {"name": "183", "class_name": "BatchNormalization", "config": {"name": "183", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["182", 0, 0, {}]]]}, {"name": "184", "class_name": "Activation", "config": {"name": "184", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["183", 0, 0, {}]]]}, {"name": "185_pad", "class_name": "ZeroPadding2D", "config": {"name": "185_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["184", 0, 0, {}]]]}, {"name": "185", "class_name": "Conv2D", "config": {"name": "185", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["185_pad", 0, 0, {}]]]}, {"name": "186", "class_name": "BatchNormalization", "config": {"name": "186", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["185", 0, 0, {}]]]}, {"name": "187", "class_name": "Add", "config": {"name": "187", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["186", 0, 0, {}], ["181", 0, 0, {}]]]}, {"name": "output_4", "class_name": "Activation", "config": {"name": "output_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["187", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0], ["output_3", 0, 0], ["output_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "123/kernel", "shape": [7, 7, 3, 64], "dtype": "float32", "quantization": {"min": -0.8672033786773682, "scale": 0.007349181175231934, "dtype": "uint8"}}, {"name": "124/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0, "scale": 0.0024877826039108454, "dtype": "uint8"}}, {"name": "124/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.6312156716982523, "scale": 0.005049725373586019, "dtype": "uint8"}}, {"name": "124/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.9747074865827373, "scale": 0.009747074865827373, "dtype": "uint8"}}, {"name": "124/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 7.236647160690796e-15, "scale": 0.006001815141416035, "dtype": "uint8"}}, {"name": "127/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.8556379243439319, "scale": 0.005781337326648189, "dtype": "uint8"}}, {"name": "128/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.16161352396011353, "scale": 0.0019459238239363129, "dtype": "uint8"}}, {"name": "128/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5433747534658394, "scale": 0.0033960922091614966, "dtype": "uint8"}}, {"name": "128/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.4256495424345426, "scale": 0.01564935188667447, "dtype": "uint8"}}, {"name": "128/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.06183897703886032, "scale": 0.006804428410296347, "dtype": "uint8"}}, {"name": "130/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.4868252638508292, "scale": 0.003267283650005565, "dtype": "uint8"}}, {"name": "131/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.09926335513591766, "scale": 0.0020139059015348844, "dtype": "uint8"}}, {"name": "131/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.4296572068158318, "scale": 0.003580476723465265, "dtype": "uint8"}}, {"name": "131/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.6821498597369475, "scale": 0.006258255593916949, "dtype": "uint8"}}, {"name": "131/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.03848591074347496, "scale": 0.0018805138182406331, "dtype": "uint8"}}, {"name": "134/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.60890500311758, "scale": 0.004991024615717869, "dtype": "uint8"}}, {"name": "135/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.16848872601985931, "scale": 0.0012494112346686569, "dtype": "uint8"}}, {"name": "135/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5035447404665105, "scale": 0.002893935290037417, "dtype": "uint8"}}, {"name": "135/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.7522319139218796, "scale": 0.0193819148867738, "dtype": "uint8"}}, {"name": "135/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.1653222143650055, "scale": 0.0034732331247890698, "dtype": "uint8"}}, {"name": "137/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.3818814365302815, "scale": 0.0027874557410969454, "dtype": "uint8"}}, {"name": "138/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.05347573757171631, "scale": 0.0024101371858634203, "dtype": "uint8"}}, {"name": "138/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.452700303699456, "scale": 0.0028834414248372995, "dtype": "uint8"}}, {"name": "138/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.6192126084776486, "scale": 0.005578491968267104, "dtype": "uint8"}}, {"name": "138/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.04164518415927887, "scale": 0.0006663941869548723, "dtype": "uint8"}}, {"name": "141/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.34850376061364713, "scale": 0.002744124099320056, "dtype": "uint8"}}, {"name": "142/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.16900408267974854, "scale": 0.0008603771527608236, "dtype": "uint8"}}, {"name": "142/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.3490113405620351, "scale": 0.003323917529162239, "dtype": "uint8"}}, {"name": "142/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.6629549475277172, "scale": 0.012318184796501609, "dtype": "uint8"}}, {"name": "142/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.3097532391548157, "scale": 0.005390563431908102, "dtype": "uint8"}}, {"name": "144/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.37887114870781996, "scale": 0.0032661305923087926, "dtype": "uint8"}}, {"name": "145/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.11469447612762451, "scale": 0.0020311724905874213, "dtype": "uint8"}}, {"name": "145/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.3147380510965983, "scale": 0.0017882843812306723, "dtype": "uint8"}}, {"name": "145/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.1561070832551694, "scale": 0.00624922747705497, "dtype": "uint8"}}, {"name": "145/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.05661628767848015, "scale": 0.001251248124183393, "dtype": "uint8"}}, {"name": "146/kernel", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"min": -0.7909059215994443, "scale": 0.006430129443897921, "dtype": "uint8"}}, {"name": "147/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": -0.0, "scale": 0.0021687241889737255, "dtype": "uint8"}}, {"name": "147/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.3147380510965983, "scale": 0.0017882843812306723, "dtype": "uint8"}}, {"name": "147/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.8467296226351869, "scale": 0.007299393298579197, "dtype": "uint8"}}, {"name": "147/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.012229976244270802, "scale": 0.000941362228317588, "dtype": "uint8"}}, {"name": "150/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.42083126902580265, "scale": 0.0035363972187042237, "dtype": "uint8"}}, {"name": "151/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.19138333201408386, "scale": 0.000992038086348889, "dtype": "uint8"}}, {"name": "151/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.6682116389274597, "scale": 0.0023284606781660343, "dtype": "uint8"}}, {"name": "151/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.839867737713982, "scale": 0.011287532133214614, "dtype": "uint8"}}, {"name": "151/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.20021991431713104, "scale": 0.002620397654234194, "dtype": "uint8"}}, {"name": "153/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.33532301958869487, "scale": 0.0026197110905366787, "dtype": "uint8"}}, {"name": "154/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.034139472991228104, "scale": 0.0025326321376305003, "dtype": "uint8"}}, {"name": "154/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.5589687813730801, "scale": 0.003158015713972204, "dtype": "uint8"}}, {"name": "154/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.7663038328582166, "scale": 0.00504147258459353, "dtype": "uint8"}}, {"name": "154/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.03305884823203087, "scale": 0.0004773371505971048, "dtype": "uint8"}}, {"name": "157/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.4845463446542328, "scale": 0.0034859449255700203, "dtype": "uint8"}}, {"name": "158/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.20831017196178436, "scale": 0.0011959055475160188, "dtype": "uint8"}}, {"name": "158/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.4412810022340101, "scale": 0.0026744303165697585, "dtype": "uint8"}}, {"name": "158/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -1.7289921716147776, "scale": 0.009659174143099317, "dtype": "uint8"}}, {"name": "158/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.24198806285858154, "scale": 0.004227518100364536, "dtype": "uint8"}}, {"name": "160/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.34850997854681576, "scale": 0.0027016277406729902, "dtype": "uint8"}}, {"name": "161/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.18752361834049225, "scale": 0.001977546016375224, "dtype": "uint8"}}, {"name": "161/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.3840487827272976, "scale": 0.0020213093827752505, "dtype": "uint8"}}, {"name": "161/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.8161159802885617, "scale": 0.0050690433558295755, "dtype": "uint8"}}, {"name": "161/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.11394461989402771, "scale": 0.0019763157648198743, "dtype": "uint8"}}, {"name": "162/kernel", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"min": -0.30409731000077495, "scale": 0.0023944670078801175, "dtype": "uint8"}}, {"name": "163/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.006212024483829737, "scale": 0.0010112777699296382, "dtype": "uint8"}}, {"name": "163/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.3840487827272976, "scale": 0.0020213093827752505, "dtype": "uint8"}}, {"name": "163/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.34662057792439177, "scale": 0.002342030931921566, "dtype": "uint8"}}, {"name": "163/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.009489933028817177, "scale": 0.00016680719951788585, "dtype": "uint8"}}, {"name": "166/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.333211626959782, "scale": 0.0024322016566407445, "dtype": "uint8"}}, {"name": "167/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.12611094117164612, "scale": 0.0012702303774216595, "dtype": "uint8"}}, {"name": "167/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.6551006029633915, "scale": 0.003032873161867553, "dtype": "uint8"}}, {"name": "167/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -2.0800082047780357, "scale": 0.014964087804158529, "dtype": "uint8"}}, {"name": "167/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.2688758075237274, "scale": 0.003778900469050688, "dtype": "uint8"}}, {"name": "169/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.31309746527204324, "scale": 0.00252497955864551, "dtype": "uint8"}}, {"name": "170/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.023125622421503067, "scale": 0.0024541769395856295, "dtype": "uint8"}}, {"name": "170/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.7057323835644067, "scale": 0.0034258853571087705, "dtype": "uint8"}}, {"name": "170/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.7315990146468667, "scale": 0.005671310191060983, "dtype": "uint8"}}, {"name": "170/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.024118572473526, "scale": 0.0003750421252905154, "dtype": "uint8"}}, {"name": "173/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.26172939106529836, "scale": 0.0026982411450030756, "dtype": "uint8"}}, {"name": "174/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.12549848854541779, "scale": 0.0011115622871062335, "dtype": "uint8"}}, {"name": "174/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.48149724436156893, "scale": 0.00234876704566619, "dtype": "uint8"}}, {"name": "174/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -2.225307157460381, "scale": 0.015782320265676462, "dtype": "uint8"}}, {"name": "174/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.29069939255714417, "scale": 0.0037394779569962446, "dtype": "uint8"}}, {"name": "176/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.31448353891279185, "scale": 0.0025990375116759657, "dtype": "uint8"}}, {"name": "177/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.12844398617744446, "scale": 0.0022671976510216206, "dtype": "uint8"}}, {"name": "177/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4289528986986946, "scale": 0.0019149682977620294, "dtype": "uint8"}}, {"name": "177/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.6927314627404307, "scale": 0.004557443833818623, "dtype": "uint8"}}, {"name": "177/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.03694591671228409, "scale": 0.0008347669360684413, "dtype": "uint8"}}, {"name": "178/kernel", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"min": -0.6609599305134194, "scale": 0.0054177043484706505, "dtype": "uint8"}}, {"name": "179/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": -0.03600857476977741, "scale": 0.0018951881457777585, "dtype": "uint8"}}, {"name": "179/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4289528986986946, "scale": 0.0019149682977620294, "dtype": "uint8"}}, {"name": "179/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.350884879804125, "scale": 0.003617369894887887, "dtype": "uint8"}}, {"name": "179/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 