{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 192, 640], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "123_pad", "class_name": "ZeroPadding2D", "config": {"name": "123_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "123", "class_name": "Conv2D", "config": {"name": "123", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["123_pad", 0, 0, {}]]]}, {"name": "124", "class_name": "BatchNormalization", "config": {"name": "124", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["123", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["124", 0, 0, {}]]]}, {"name": "126_pad", "class_name": "ZeroPadding2D", "config": {"name": "126_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"name": "126", "class_name": "MaxPooling2D", "config": {"name": "126", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["126_pad", 0, 0, {}]]]}, {"name": "127_pad", "class_name": "ZeroPadding2D", "config": {"name": "127_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["126", 0, 0, {}]]]}, {"name": "127", "class_name": "Conv2D", "config": {"name": "127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["127_pad", 0, 0, {}]]]}, {"name": "128", "class_name": "BatchNormalization", "config": {"name": "128", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["127", 0, 0, {}]]]}, {"name": "129", "class_name": "Activation", "config": {"name": "129", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["128", 0, 0, {}]]]}, {"name": "130_pad", "class_name": "ZeroPadding2D", "config": {"name": "130_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "130", "class_name": "Conv2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["130_pad", 0, 0, {}]]]}, {"name": "131", "class_name": "BatchNormalization", "config": {"name": "131", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "132", "class_name": "Add", "config": {"name": "132", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["131", 0, 0, {}], ["126", 0, 0, {}]]]}, {"name": "133", "class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["132", 0, 0, {}]]]}, {"name": "134_pad", "class_name": "ZeroPadding2D", "config": {"name": "134_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["133", 0, 0, {}]]]}, {"name": "134", "class_name": "Conv2D", "config": {"name": "134", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["134_pad", 0, 0, {}]]]}, {"name": "135", "class_name": "BatchNormalization", "config": {"name": "135", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["134", 0, 0, {}]]]}, {"name": "136", "class_name": "Activation", "config": {"name": "136", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["135", 0, 0, {}]]]}, {"name": "137_pad", "class_name": "ZeroPadding2D", "config": {"name": "137_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["136", 0, 0, {}]]]}, {"name": "137", "class_name": "Conv2D", "config": {"name": "137", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["137_pad", 0, 0, {}]]]}, {"name": "138", "class_name": "BatchNormalization", "config": {"name": "138", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "139", "class_name": "Add", "config": {"name": "139", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["138", 0, 0, {}], ["133", 0, 0, {}]]]}, {"name": "output_1", "class_name": "Activation", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["139", 0, 0, {}]]]}, {"name": "141_pad", "class_name": "ZeroPadding2D", "config": {"name": "141_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "141", "class_name": "Conv2D", "config": {"name": "141", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["141_pad", 0, 0, {}]]]}, {"name": "142", "class_name": "BatchNormalization", "config": {"name": "142", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["141", 0, 0, {}]]]}, {"name": "143", "class_name": "Activation", "config": {"name": "143", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["142", 0, 0, {}]]]}, {"name": "144_pad", "class_name": "ZeroPadding2D", "config": {"name": "144_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "144", "class_name": "Conv2D", "config": {"name": "144", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["144_pad", 0, 0, {}]]]}, {"name": "146", "class_name": "Conv2D", "config": {"name": "146", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "145", "class_name": "BatchNormalization", "config": {"name": "145", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["144", 0, 0, {}]]]}, {"name": "147", "class_name": "BatchNormalization", "config": {"name": "147", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["146", 0, 0, {}]]]}, {"name": "148", "class_name": "Add", "config": {"name": "148", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["145", 0, 0, {}], ["147", 0, 0, {}]]]}, {"name": "149", "class_name": "Activation", "config": {"name": "149", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["148", 0, 0, {}]]]}, {"name": "150_pad", "class_name": "ZeroPadding2D", "config": {"name": "150_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["149", 0, 0, {}]]]}, {"name": "150", "class_name": "Conv2D", "config": {"name": "150", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["150_pad", 0, 0, {}]]]}, {"name": "151", "class_name": "BatchNormalization", "config": {"name": "151", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["150", 0, 0, {}]]]}, {"name": "152", "class_name": "Activation", "config": {"name": "152", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["151", 0, 0, {}]]]}, {"name": "153_pad", "class_name": "ZeroPadding2D", "config": {"name": "153_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["152", 0, 0, {}]]]}, {"name": "153", "class_name": "Conv2D", "config": {"name": "153", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["153_pad", 0, 0, {}]]]}, {"name": "154", "class_name": "BatchNormalization", "config": {"name": "154", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["153", 0, 0, {}]]]}, {"name": "155", "class_name": "Add", "config": {"name": "155", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["154", 0, 0, {}], ["149", 0, 0, {}]]]}, {"name": "output_2", "class_name": "Activation", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["155", 0, 0, {}]]]}, {"name": "157_pad", "class_name": "ZeroPadding2D", "config": {"name": "157_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "157", "class_name": "Conv2D", "config": {"name": "157", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["157_pad", 0, 0, {}]]]}, {"name": "158", "class_name": "BatchNormalization", "config": {"name": "158", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["157", 0, 0, {}]]]}, {"name": "159", "class_name": "Activation", "config": {"name": "159", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["158", 0, 0, {}]]]}, {"name": "160_pad", "class_name": "ZeroPadding2D", "config": {"name": "160_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["159", 0, 0, {}]]]}, {"name": "160", "class_name": "Conv2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["160_pad", 0, 0, {}]]]}, {"name": "162", "class_name": "Conv2D", "config": {"name": "162", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "161", "class_name": "BatchNormalization", "config": {"name": "161", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["160", 0, 0, {}]]]}, {"name": "163", "class_name": "BatchNormalization", "config": {"name": "163", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Add", "config": {"name": "164", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["161", 0, 0, {}], ["163", 0, 0, {}]]]}, {"name": "165", "class_name": "Activation", "config": {"name": "165", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["164", 0, 0, {}]]]}, {"name": "166_pad", "class_name": "ZeroPadding2D", "config": {"name": "166_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["165", 0, 0, {}]]]}, {"name": "166", "class_name": "Conv2D", "config": {"name": "166", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["166_pad", 0, 0, {}]]]}, {"name": "167", "class_name": "BatchNormalization", "config": {"name": "167", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["166", 0, 0, {}]]]}, {"name": "168", "class_name": "Activation", "config": {"name": "168", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["167", 0, 0, {}]]]}, {"name": "169_pad", "class_name": "ZeroPadding2D", "config": {"name": "169_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["168", 0, 0, {}]]]}, {"name": "169", "class_name": "Conv2D", "config": {"name": "169", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["169_pad", 0, 0, {}]]]}, {"name": "170", "class_name": "BatchNormalization", "config": {"name": "170", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["169", 0, 0, {}]]]}, {"name": "171", "class_name": "Add", "config": {"name": "171", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["170", 0, 0, {}], ["165", 0, 0, {}]]]}, {"name": "output_3", "class_name": "Activation", "config": {"name": "output_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["171", 0, 0, {}]]]}, {"name": "173_pad", "class_name": "ZeroPadding2D", "config": {"name": "173_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "173", "class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["173_pad", 0, 0, {}]]]}, {"name": "174", "class_name": "BatchNormalization", "config": {"name": "174", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["173", 0, 0, {}]]]}, {"name": "175", "class_name": "Activation", "config": {"name": "175", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "176_pad", "class_name": "ZeroPadding2D", "config": {"name": "176_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "176", "class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["176_pad", 0, 0, {}]]]}, {"name": "178", "class_name": "Conv2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "177", "class_name": "BatchNormalization", "config": {"name": "177", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "179", "class_name": "BatchNormalization", "config": {"name": "179", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "Add", "config": {"name": "180", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["177", 0, 0, {}], ["179", 0, 0, {}]]]}, {"name": "181", "class_name": "Activation", "config": {"name": "181", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["180", 0, 0, {}]]]}, {"name": "182_pad", "class_name": "ZeroPadding2D", "config": {"name": "182_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["181", 0, 0, {}]]]}, {"name": "182", "class_name": "Conv2D", "config": {"name": "182", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["182_pad", 0, 0, {}]]]}, {"name": "183", "class_name": "BatchNormalization", "config": {"name": "183", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["182", 0, 0, {}]]]}, {"name": "184", "class_name": "Activation", "config": {"name": "184", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["183", 0, 0, {}]]]}, {"name": "185_pad", "class_name": "ZeroPadding2D", "config": {"name": "185_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["184", 0, 0, {}]]]}, {"name": "185", "class_name": "Conv2D", "config": {"name": "185", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["185_pad", 0, 0, {}]]]}, {"name": "186", "class_name": "BatchNormalization", "config": {"name": "186", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["185", 0, 0, {}]]]}, {"name": "187", "class_name": "Add", "config": {"name": "187", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["186", 0, 0, {}], ["181", 0, 0, {}]]]}, {"name": "output_4", "class_name": "Activation", "config": {"name": "output_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["187", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0], ["output_3", 0, 0], ["output_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "123/kernel", "shape": [7, 7, 3, 64], "dtype": "float32", "quantization": {"min": -0.8676161672554764, "scale": 0.007352679383520987, "dtype": "uint8"}}, {"name": "124/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0, "scale": 0.0024971290796990367, "dtype": "uint8"}}, {"name": "124/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.6336189368191887, "scale": 0.00506895149455351, "dtype": "uint8"}}, {"name": "124/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -1.7699343671985701, "scale": 0.011273467306997262, "dtype": "uint8"}}, {"name": "124/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 1.356677221736255e-13, "scale": 0.11899918200922895, "dtype": "uint8"}}, {"name": "127/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.8519705725651161, "scale": 0.005756557922737271, "dtype": "uint8"}}, {"name": "128/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.16341762244701385, "scale": 0.0019293579985113704, "dtype": "uint8"}}, {"name": "128/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5246946034478206, "scale": 0.0033851264738569073, "dtype": "uint8"}}, {"name": "128/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.566757546219171, "scale": 0.01734295639337278, "dtype": "uint8"}}, {"name": "128/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.06567942351102829, "scale": 0.006731816395825031, "dtype": "uint8"}}, {"name": "130/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.4747025213989557, "scale": 0.0032074494689118627, "dtype": "uint8"}}, {"name": "131/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0923091471195221, "scale": 0.0020269481574787815, "dtype": "uint8"}}, {"name": "131/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.4326672603102291, "scale": 0.003517620002522188, "dtype": "uint8"}}, {"name": "131/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.7333452996085672, "scale": 0.007407528278874416, "dtype": "uint8"}}, {"name": "131/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0423671156167984, "scale": 0.00168168235058878, "dtype": "uint8"}}, {"name": "134/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.6048040118871951, "scale": 0.004957409933501599, "dtype": "uint8"}}, {"name": "135/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.16787508130073547, "scale": 0.0011938878134185192, "dtype": "uint8"}}, {"name": "135/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5138935099629794, "scale": 0.0028709134634803323, "dtype": "uint8"}}, {"name": "135/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.785135138268564, "scale": 0.018444603564692477, "dtype": "uint8"}}, {"name": "135/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.1743856519460678, "scale": 0.0034729584174997665, "dtype": "uint8"}}, {"name": "137/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.3947821610114154, "scale": 0.00288162161322201, "dtype": "uint8"}}, {"name": "138/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.05060078203678131, "scale": 0.0024419702151242425, "dtype": "uint8"}}, {"name": "138/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.46073217765957697, "scale": 0.002934599857704312, "dtype": "uint8"}}, {"name": "138/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5822856585184732, "scale": 0.00534207026163737, "dtype": "uint8"}}, {"name": "138/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.04241348057985306, "scale": 0.0007104692213675555, "dtype": "uint8"}}, {"name": "141/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.35045238569671033, "scale": 0.0028725605384976255, "dtype": "uint8"}}, {"name": "142/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.16497644782066345, "scale": 0.0008539165936264337, "dtype": "uint8"}}, {"name": "142/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.35296575415368175, "scale": 0.0033298656052234126, "dtype": "uint8"}}, {"name": "142/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.7764551401138307, "scale": 0.011610817909240723, "dtype": "uint8"}}, {"name": "142/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.2489267736673355, "scale": 0.005750966948621413, "dtype": "uint8"}}, {"name": "144/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.38385287745326174, "scale": 0.0033378511082892324, "dtype": "uint8"}}, {"name": "145/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.1032896414399147, "scale": 0.0020625005457915514, "dtype": "uint8"}}, {"name": "145/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.3005114396413167, "scale": 0.001767714350831275, "dtype": "uint8"}}, {"name": "145/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.2043242440504187, "scale": 0.00658100679808972, "dtype": "uint8"}}, {"name": "145/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.054684899747371674, "scale": 0.0011600218859373354, "dtype": "uint8"}}, {"name": "146/kernel", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"min": -0.7937774845198089, "scale": 0.006401431326772652, "dtype": "uint8"}}, {"name": "147/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.00016716023674234748, "scale": 0.0021417495121211546, "dtype": "uint8"}}, {"name": "147/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.3005114396413167, "scale": 0.001767714350831275, "dtype": "uint8"}}, {"name": "147/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.8998938261293896, "scale": 0.008180852964812633, "dtype": "uint8"}}, {"name": "147/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.013356508687138557, "scale": 0.0009794156852306105, "dtype": "uint8"}}, {"name": "150/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.4194251537322998, "scale": 0.0035245811238008387, "dtype": "uint8"}}, {"name": "151/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.18208353221416473, "scale": 0.0010680469227772134, "dtype": "uint8"}}, {"name": "151/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.6644437909126282, "scale": 0.002323063331491807, "dtype": "uint8"}}, {"name": "151/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.7819285252515007, "scale": 0.012289162243113797, "dtype": "uint8"}}, {"name": "151/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.18349246680736542, "scale": 0.002133865975866131, "dtype": "uint8"}}, {"name": "153/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.3244737360991684, "scale": 0.0027497774245692237, "dtype": "uint8"}}, {"name": "154/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.03881374001502991, "scale": 0.002512643968357759, "dtype": "uint8"}}, {"name": "154/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.5674742778142293, "scale": 0.003188057740529378, "dtype": "uint8"}}, {"name": "154/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.702799155665379, "scale": 0.0046542990441415825, "dtype": "uint8"}}, {"name": "154/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.0355231799185276, "scale": 0.0005202681848815843, "dtype": "uint8"}}, {"name": "157/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.46581906606169304, "scale": 0.0034505116004569856, "dtype": "uint8"}}, {"name": "158/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.2146766185760498, "scale": 0.0011389451868393842, "dtype": "uint8"}}, {"name": "158/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.45004327098528546, "scale": 0.0026473133587369734, "dtype": "uint8"}}, {"name": "158/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -1.7317434226765354, "scale": 0.01012715451857623, "dtype": "uint8"}}, {"name": "158/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.2631279230117798, "scale": 0.004073076154671463, "dtype": "uint8"}}, {"name": "160/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.36461508040334667, "scale": 0.0028047313877180512, "dtype": "uint8"}}, {"name": "161/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.17844060063362122, "scale": 0.0019834863204582064, "dtype": "uint8"}}, {"name": "161/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.38729433861433293, "scale": 0.00203839125586491, "dtype": "uint8"}}, {"name": "161/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -1.002271948374954, "scale": 0.0056307412830053595, "dtype": "uint8"}}, {"name": "161/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.12362609058618546, "scale": 0.00225534401103562, "dtype": "uint8"}}, {"name": "162/kernel", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"min": -0.30863321061227833, "scale": 0.002374101620094449, "dtype": "uint8"}}, {"name": "163/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.014321376569569111, "scale": 0.0010362308801097027, "dtype": "uint8"}}, {"name": "163/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.38729433861433293, "scale": 0.00203839125586491, "dtype": "uint8"}}, {"name": "163/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.4027324455625871, "scale": 0.0022007237462436454, "dtype": "uint8"}}, {"name": "163/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.009283162653446198, "scale": 0.0001902021613775515, "dtype": "uint8"}}, {"name": "166/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.34593693029646777, "scale": 0.0024887548942191928, "dtype": "uint8"}}, {"name": "167/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.13795511424541473, "scale": 0.0012709792338165583, "dtype": "uint8"}}, {"name": "167/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.6429476930814632, "scale": 0.0030471454648410574, "dtype": "uint8"}}, {"name": "167/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -2.6775100651909325, "scale": 0.017850067101272883, "dtype": "uint8"}}, {"name": "167/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.26939061284065247, "scale": 0.004861434183868707, "dtype": "uint8"}}, {"name": "169/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.3179342648562263, "scale": 0.0024269791210398952, "dtype": "uint8"}}, {"name": "170/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.025483176112174988, "scale": 0.002360186915771634, "dtype": "uint8"}}, {"name": "170/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.7222122637664571, "scale": 0.0034391060179355098, "dtype": "uint8"}}, {"name": "170/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.6515384713808696, "scale": 0.005475113204881257, "dtype": "uint8"}}, {"name": "170/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.02453857660293579, "scale": 0.0004620071719674503, "dtype": "uint8"}}, {"name": "173/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.28168522119522094, "scale": 0.002761619815639421, "dtype": "uint8"}}, {"name": "174/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.11537327617406845, "scale": 0.0011116012930870057, "dtype": "uint8"}}, {"name": "174/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4756134999733345, "scale": 0.0022756626792982512, "dtype": "uint8"}}, {"name": "174/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -2.0281760248483396, "scale": 0.015482259731666715, "dtype": "uint8"}}, {"name": "174/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.32514429092407227, "scale": 0.004200016751008875, "dtype": "uint8"}}, {"name": "176/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.32316332529572883, "scale": 0.0026273441080953562, "dtype": "uint8"}}, {"name": "177/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.11154425144195557, "scale": 0.0023331151289098405, "dtype": "uint8"}}, {"name": "177/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4324519206495846, "scale": 0.00190507454030654, "dtype": "uint8"}}, {"name": "177/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.6094745734158684, "scale": 0.003957627100103041, "dtype": "uint8"}}, {"name": "177/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.04149608686566353, "scale": 0.0007990956160367704, "dtype": "uint8"}}, {"name": "178/kernel", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"min": -0.6462041868883021, "scale": 0.005523112708447026, "dtype": "uint8"}}, {"name": "179/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": -0.03726303957256616, "scale": 0.0018631519786283081, "dtype": "uint8"}}, {"name": "179/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4324519206495846, "scale": 0.00190507454030654, "dtype": "uint8"}}, {"name": "179/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.33120263183818144, "scale": 0.0035613186219159293, "dtype": "uint8"}}, {"name": "179/moving_variance", "shape": [512], "dtype": "float32", "quantization": 