{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "335_pad", "class_name": "ZeroPadding2D", "config": {"name": "335_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "335", "class_name": "Conv2D", "config": {"name": "335", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["335_pad", 0, 0, {}]]]}, {"name": "336", "class_name": "BatchNormalization", "config": {"name": "336", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["335", 0, 0, {}]]]}, {"name": "337", "class_name": "Activation", "config": {"name": "337", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["336", 0, 0, {}]]]}, {"name": "338_pad", "class_name": "ZeroPadding2D", "config": {"name": "338_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["337", 0, 0, {}]]]}, {"name": "338", "class_name": "DepthwiseConv2D", "config": {"name": "338", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["338_pad", 0, 0, {}]]]}, {"name": "339", "class_name": "BatchNormalization", "config": {"name": "339", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["338", 0, 0, {}]]]}, {"name": "340", "class_name": "Activation", "config": {"name": "340", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["339", 0, 0, {}]]]}, {"name": "341", "class_name": "Conv2D", "config": {"name": "341", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["340", 0, 0, {}]]]}, {"name": "342", "class_name": "BatchNormalization", "config": {"name": "342", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["341", 0, 0, {}]]]}, {"name": "343", "class_name": "Add", "config": {"name": "343", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["337", 0, 0, {}], ["342", 0, 0, {}]]]}, {"name": "344", "class_name": "Conv2D", "config": {"name": "344", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["343", 0, 0, {}]]]}, {"name": "345", "class_name": "BatchNormalization", "config": {"name": "345", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["344", 0, 0, {}]]]}, {"name": "346", "class_name": "Activation", "config": {"name": "346", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["345", 0, 0, {}]]]}, {"name": "347_pad", "class_name": "ZeroPadding2D", "config": {"name": "347_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["346", 0, 0, {}]]]}, {"name": "347", "class_name": "DepthwiseConv2D", "config": {"name": "347", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["347_pad", 0, 0, {}]]]}, {"name": "348", "class_name": "BatchNormalization", "config": {"name": "348", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["347", 0, 0, {}]]]}, {"name": "349", "class_name": "Activation", "config": {"name": "349", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["348", 0, 0, {}]]]}, {"name": "350", "class_name": "Conv2D", "config": {"name": "350", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["349", 0, 0, {}]]]}, {"name": "351", "class_name": "BatchNormalization", "config": {"name": "351", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["350", 0, 0, {}]]]}, {"name": "352", "class_name": "Conv2D", "config": {"name": "352", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["351", 0, 0, {}]]]}, {"name": "353", "class_name": "BatchNormalization", "config": {"name": "353", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["352", 0, 0, {}]]]}, {"name": "354", "class_name": "Activation", "config": {"name": "354", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["353", 0, 0, {}]]]}, {"name": "355_pad", "class_name": "ZeroPadding2D", "config": {"name": "355_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["354", 0, 0, {}]]]}, {"name": "355", "class_name": "DepthwiseConv2D", "config": {"name": "355", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["355_pad", 0, 0, {}]]]}, {"name": "356", "class_name": "BatchNormalization", "config": {"name": "356", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["355", 0, 0, {}]]]}, {"name": "357", "class_name": "Activation", "config": {"name": "357", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["356", 0, 0, {}]]]}, {"name": "358", "class_name": "Conv2D", "config": {"name": "358", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["357", 0, 0, {}]]]}, {"name": "359", "class_name": "BatchNormalization", "config": {"name": "359", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["358", 0, 0, {}]]]}, {"name": "360", "class_name": "Add", "config": {"name": "360", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["351", 0, 0, {}], ["359", 0, 0, {}]]]}, {"name": "361", "class_name": "Conv2D", "config": {"name": "361", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["360", 0, 0, {}]]]}, {"name": "362", "class_name": "BatchNormalization", "config": {"name": "362", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["361", 0, 0, {}]]]}, {"name": "363", "class_name": "Activation", "config": {"name": "363", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["362", 0, 0, {}]]]}, {"name": "364_pad", "class_name": "ZeroPadding2D", "config": {"name": "364_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["363", 0, 0, {}]]]}, {"name": "364", "class_name": "DepthwiseConv2D", "config": {"name": "364", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["364_pad", 0, 0, {}]]]}, {"name": "365", "class_name": "BatchNormalization", "config": {"name": "365", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["364", 0, 0, {}]]]}, {"name": "372", "class_name": "ZeroPadding2D", "config": {"name": "372", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["365", 0, 0, {}]]]}, {"name": "373", "class_name": "AveragePooling2D", "config": {"name": "373", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "inbound_nodes": [[["372", 0, 0, {}]]]}, {"name": "377", "class_name": "Reshape", "config": {"name": "377", "trainable": true, "dtype": "float32", "target_shape": [72]}, "inbound_nodes": [[["373", 0, 0, {}]]]}, {"name": "378", "class_name": "Dense", "config": {"name": "378", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["377", 0, 0, {}]]]}, {"name": "379", "class_name": "Activation", "config": {"name": "379", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["378", 0, 0, {}]]]}, {"name": "380", "class_name": "Dense", "config": {"name": "380", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["379", 0, 0, {}]]]}, {"name": "381", "class_name": "Activation", "config": {"name": "381", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["380", 0, 0, {}]]]}, {"name": "389", "class_name": "Reshape", "config": {"name": "389", "trainable": true, "dtype": "float32", "target_shape": [72, 1, 1]}, "inbound_nodes": [[["381", 0, 0, {}]]]}, {"name": "390", "class_name": "Multiply", "config": {"name": "390", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["365", 0, 0, {}], ["389", 0, 0, {}]]]}, {"name": "391", "class_name": "Activation", "config": {"name": "391", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["390", 0, 0, {}]]]}, {"name": "392", "class_name": "Conv2D", "config": {"name": "392", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["391", 0, 0, {}]]]}, {"name": "393", "class_name": "BatchNormalization", "config": {"name": "393", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["392", 0, 0, {}]]]}, {"name": "394", "class_name": "Conv2D", "config": {"name": "394", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["393", 0, 0, {}]]]}, {"name": "395", "class_name": "BatchNormalization", "config": {"name": "395", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["394", 0, 0, {}]]]}, {"name": "396", "class_name": "Activation", "config": {"name": "396", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["395", 0, 0, {}]]]}, {"name": "397_pad", "class_name": "ZeroPadding2D", "config": {"name": "397_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["396", 0, 0, {}]]]}, {"name": "397", "class_name": "DepthwiseConv2D", "config": {"name": "397", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["397_pad", 0, 0, {}]]]}, {"name": "398", "class_name": "BatchNormalization", "config": {"name": "398", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["397", 0, 0, {}]]]}, {"name": "405", "class_name": "ZeroPadding2D", "config": {"name": "405", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["398", 0, 0, {}]]]}, {"name": "406", "class_name": "AveragePooling2D", "config": {"name": "406", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "inbound_nodes": [[["405", 0, 0, {}]]]}, {"name": "410", "class_name": "Reshape", "config": {"name": "410", "trainable": true, "dtype": "float32", "target_shape": [120]}, "inbound_nodes": [[["406", 0, 0, {}]]]}, {"name": "411", "class_name": "Dense", "config": {"name": "411", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["410", 0, 0, {}]]]}, {"name": "412", "class_name": "Activation", "config": {"name": "412", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["411", 0, 0, {}]]]}, {"name": "413", "class_name": "Dense", "config": {"name": "413", "trainable": true, "dtype": "float32", "units": 120, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["412", 0, 0, {}]]]}, {"name": "414", "class_name": "Activation", "config": {"name": "414", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["413", 0, 0, {}]]]}, {"name": "422", "class_name": "Reshape", "config": {"name": "422", "trainable": true, "dtype": "float32", "target_shape": [120, 1, 1]}, "inbound_nodes": [[["414", 0, 0, {}]]]}, {"name": "423", "class_name": "Multiply", "config": {"name": "423", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["398", 0, 0, {}], ["422", 0, 0, {}]]]}, {"name": "424", "class_name": "Activation", "config": {"name": "424", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["423", 0, 0, {}]]]}, {"name": "425", "class_name": "Conv2D", "config": {"name": "425", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["424", 0, 0, {}]]]}, {"name": "426", "class_name": "BatchNormalization", "config": {"name": "426", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["425", 0, 0, {}]]]}, {"name": "427", "class_name": "Add", "config": {"name": "427", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["393", 0, 0, {}], ["426", 0, 0, {}]]]}, {"name": "428", "class_name": "Conv2D", "config": {"name": "428", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["427", 0, 0, {}]]]}, {"name": "429", "class_name": "BatchNormalization", "config": {"name": "429", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["428", 0, 0, {}]]]}, {"name": "430", "class_name": "Activation", "config": {"name": "430", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["429", 0, 0, {}]]]}, {"name": "431_pad", "class_name": "ZeroPadding2D", "config": {"name": "431_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "inbound_nodes": [[["430", 0, 0, {}]]]}, {"name": "431", "class_name": "DepthwiseConv2D", "config": {"name": "431", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["431_pad", 0, 0, {}]]]}, {"name": "432", "class_name": "BatchNormalization", "config": {"name": "432", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["431", 0, 0, {}]]]}, {"name": "439", "class_name": "ZeroPadding2D", "config": {"name": "439", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["432", 0, 0, {}]]]}, {"name": "440", "class_name": "AveragePooling2D", "config": {"name": "440", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "inbound_nodes": [[["439", 0, 0, {}]]]}, {"name": "444", "class_name": "Reshape", "config": {"name": "444", "trainable": true, "dtype": "float32", "target_shape": [120]}, "inbound_nodes": [[["440", 0, 0, {}]]]}, {"name": "445", "class_name": "Dense", "config": {"name": "445", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["444", 0, 0, {}]]]}, {"name": "446", "class_name": "Activation", "config": {"name": "446", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["445", 0, 0, {}]]]}, {"name": "447", "class_name": "Dense", "config": {"name": "447", "trainable": true, "dtype": "float32", "units": 120, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["446", 0, 0, {}]]]}, {"name": "448", "class_name": "Activation", "config": {"name": "448", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["447", 0, 0, {}]]]}, {"name": "456", "class_name": "Reshape", "config": {"name": "456", "trainable": true, "dtype": "float32", "target_shape": [120, 1, 1]}, "inbound_nodes": [[["448", 0, 0, {}]]]}, {"name": "457", "class_name": "Multiply", "config": {"name": "457", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["432", 0, 0, {}], ["456", 0, 0, {}]]]}, {"name": "458", "class_name": "Activation", "config": {"name": "458", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["457", 0, 0, {}]]]}, {"name": "459", "class_name": "Conv2D", "config": {"name": "459", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["458", 0, 0, {}]]]}, {"name": "460", "class_name": "BatchNormalization", "config": {"name": "460", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["459", 0, 0, {}]]]}, {"name": "461", "class_name": "Add", "config": {"name": "461", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["427", 0, 0, {}], ["460", 0, 0, {}]]]}, {"name": "462", "class_name": "Conv2D", "config": {"name": "462", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["461", 0, 0, {}]]]}, {"name": "463", "class_name": "BatchNormalization", "config": {"name": "463", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["462", 0, 0, {}]]]}, {"name": "464", "class_name": "Activation", "config": {"name": "464", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["463", 0, 0, {}]]]}, {"name": "465_pad", "class_name": "ZeroPadding2D", "config": {"name": "465_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["464", 0, 0, {}]]]}, {"name": "465", "class_name": "DepthwiseConv2D", "config": {"name": "465", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["465_pad", 0, 0, {}]]]}, {"name": "466", "class_name": "BatchNormalization", "config": {"name": "466", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["465", 0, 0, {}]]]}, {"name": "467", "class_name": "Activation", "config": {"name": "467", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["466", 0, 0, {}]]]}, {"name": "468", "class_name": "Conv2D", "config": {"name": "468", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["467", 0, 0, {}]]]}, {"name": "469", "class_name": "BatchNormalization", "config": {"name": "469", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["468", 0, 0, {}]]]}, {"name": "470", "class_name": "Conv2D", "config": {"name": "470", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["469", 0, 0, {}]]]}, {"name": "471", "class_name": "BatchNormalization", "config": {"name": "471", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["470", 0, 0, {}]]]}, {"name": "472", "class_name": "Activation", "config": {"name": "472", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["471", 0, 0, {}]]]}, {"name": "473_pad", "class_name": "ZeroPadding2D", "config": {"name": "473_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["472", 0, 0, {}]]]}, {"name": "473", "class_name": "DepthwiseConv2D", "config": {"name": "473", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["473_pad", 0, 0, {}]]]}, {"name": "474", "class_name": "BatchNormalization", "config": {"name": "474", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["473", 0, 0, {}]]]}, {"name": "475", "class_name": "Activation", "config": {"name": "475", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["474", 0, 0, {}]]]}, {"name": "476", "class_name": "Conv2D", "config": {"name": "476", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["475", 0, 0, {}]]]}, {"name": "477", "class_name": "BatchNormalization", "config": {"name": "477", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["476", 0, 0, {}]]]}, {"name": "478", "class_name": "Add", "config": {"name": "478", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["469", 0, 0, {}], ["477", 0, 0, {}]]]}, {"name": "479", "class_name": "Conv2D", "config": {"name": "479", "trainable": true, "dtype": "float32", "filters": 184, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["478", 0, 0, {}]]]}, {"name": "480", "class_name": "BatchNormalization", "config": {"name": "480", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["479", 0, 0, {}]]]}, {"name": "481", "class_name": "Activation", "config": {"name": "481", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["480", 0, 0, {}]]]}, {"name": "482_pad", "class_name": "ZeroPadding2D", "config": {"name": "482_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["481", 0, 0, {}]]]}, {"name": "482", "class_name": "DepthwiseConv2D", "config": {"name": "482", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["482_pad", 0, 0, {}]]]}, {"name": "483", "class_name": "BatchNormalization", "config": {"name": "483", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["482", 0, 0, {}]]]}, {"name": "484", "class_name": "Activation", "config": {"name": "484", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["483", 0, 0, {}]]]}, {"name": "485", "class_name": "Conv2D", "config": {"name": "485", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["484", 0, 0, {}]]]}, {"name": "486", "class_name": "BatchNormalization", "config": {"name": "486", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["485", 0, 0, {}]]]}, {"name": "487", "class_name": "Add", "config": {"name": "487", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["478", 0, 0, {}], ["486", 0, 0, {}]]]}, {"name": "488", "class_name": "Conv2D", "config": {"name": "488", "trainable": true, "dtype": "float32", "filters": 184, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": 