{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "41", "class_name": "MirrorPad", "config": {"name": "41", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "42", "class_name": "DepthwiseConv2D", "config": {"name": "42", "trainable": true, "dtype": "float32", "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["41", 0, 0, {}]]]}, {"name": "43", "class_name": "Conv2D", "config": {"name": "43", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["42", 0, 0, {}]]]}, {"name": "44", "class_name": "Activation", "config": {"name": "44", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["43", 0, 0, {}]]]}, {"name": "45", "class_name": "MirrorPad", "config": {"name": "45", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["44", 0, 0, {}]]]}, {"name": "46", "class_name": "DepthwiseConv2D", "config": {"name": "46", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["45", 0, 0, {}]]]}, {"name": "47", "class_name": "Conv2D", "config": {"name": "47", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["46", 0, 0, {}]]]}, {"name": "48", "class_name": "Activation", "config": {"name": "48", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["47", 0, 0, {}]]]}, {"name": "49", "class_name": "MirrorPad", "config": {"name": "49", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["48", 0, 0, {}]]]}, {"name": "50", "class_name": "DepthwiseConv2D", "config": {"name": "50", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["49", 0, 0, {}]]]}, {"name": "51", "class_name": "Conv2D", "config": {"name": "51", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["50", 0, 0, {}]]]}, {"name": "52", "class_name": "Activation", "config": {"name": "52", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["51", 0, 0, {}]]]}, {"name": "53", "class_name": "MirrorPad", "config": {"name": "53", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["52", 0, 0, {}]]]}, {"name": "54", "class_name": "DepthwiseConv2D", "config": {"name": "54", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["53", 0, 0, {}]]]}, {"name": "55", "class_name": "Conv2D", "config": {"name": "55", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["54", 0, 0, {}]]]}, {"name": "56", "class_name": "Activation", "config": {"name": "56", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["55", 0, 0, {}]]]}, {"name": "57", "class_name": "MirrorPad", "config": {"name": "57", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["56", 0, 0, {}]]]}, {"name": "58", "class_name": "DepthwiseConv2D", "config": {"name": "58", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["57", 0, 0, {}]]]}, {"name": "59", "class_name": "Conv2D", "config": {"name": "59", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["58", 0, 0, {}]]]}, {"name": "60", "class_name": "Add", "config": {"name": "60", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["59", 0, 0, {}], ["52", 0, 0, {}]]]}, {"name": "61", "class_name": "MirrorPad", "config": {"name": "61", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["60", 0, 0, {}]]]}, {"name": "62", "class_name": "DepthwiseConv2D", "config": {"name": "62", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["61", 0, 0, {}]]]}, {"name": "63", "class_name": "Conv2D", "config": {"name": "63", "trainable": true, "dtype": "float32", "filters": 37, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["62", 0, 0, {}]]]}, {"name": "64", "class_name": "Activation", "config": {"name": "64", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["63", 0, 0, {}]]]}, {"name": "65", "class_name": "MirrorPad", "config": {"name": "65", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["64", 0, 0, {}]]]}, {"name": "66", "class_name": "DepthwiseConv2D", "config": {"name": "66", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["65", 0, 0, {}]]]}, {"name": "67", "class_name": "Conv2D", "config": {"name": "67", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["66", 0, 0, {}]]]}, {"name": "68", "class_name": "Add", "config": {"name": "68", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["67", 0, 0, {}], ["60", 0, 0, {}]]]}, {"name": "95", "class_name": "UpSampling2D", "config": {"name": "95", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["68", 0, 0, {}]]]}, {"name": "96", "class_name": "MirrorPad", "config": {"name": "96", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["95", 0, 0, {}]]]}, {"name": "97", "class_name": "DepthwiseConv2D", "config": {"name": "97", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["96", 0, 0, {}]]]}, {"name": "98", "class_name": "Conv2D", "config": {"name": "98", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "99", "class_name": "Activation", "config": {"name": "99", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["98", 0, 0, {}]]]}, {"name": "126", "class_name": "UpSampling2D", "config": {"name": "126", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["99", 0, 0, {}]]]}, {"name": "127", "class_name": "MirrorPad", "config": {"name": "127", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["126", 0, 0, {}]]]}, {"name": "128", "class_name": "DepthwiseConv2D", "config": {"name": "128", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["127", 0, 0, {}]]]}, {"name": "129", "class_name": "Conv2D", "config": {"name": "129", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["128", 0, 0, {}]]]}, {"name": "130", "class_name": "Activation", "config": {"name": "130", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "131", "class_name": "MirrorPad", "config": {"name": "131", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "132", "class_name": "DepthwiseConv2D", "config": {"name": "132", "trainable": true, "dtype": "float32", "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["131", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Conv2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["132", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "128/depthwise_kernel", "shape": [3, 3, 13, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "128/bias", "shape": [13], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "129/kernel", "shape": [1, 1, 13, 22], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "129/bias", "shape": [22], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "132/depthwise_kernel", "shape": [9, 9, 22, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "132/bias", "shape": [22], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "42/depthwise_kernel", "shape": [9, 9, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "42/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "43/kernel", "shape": [1, 1, 3, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "43/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "46/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "46/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "47/kernel", "shape": [1, 1, 32, 40], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "47/bias", "shape": [40], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "50/depthwise_kernel", "shape": [3, 3, 40, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "50/bias", "shape": [40], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "51/kernel", "shape": [1, 1, 40, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "51/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "54/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "54/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "55/kernel", "shape": [1, 1, 64, 26], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "55/bias", "shape": [26], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "58/depthwise_kernel", "shape": [3, 3, 26, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "58/bias", "shape": [26], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "59/kernel", "shape": [1, 1, 26, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "59/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "62/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "62/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "63/kernel", "shape": [1, 1, 64, 37], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "63/bias", "shape": [37], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "66/depthwise_kernel", "shape": [3, 3, 37, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "66/bias", "shape": [37], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "67/kernel", "shape": [1, 1, 37, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "67/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "97/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "97/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "98/kernel", "shape": [1, 1, 64, 13], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "98/bias", "shape": [13], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "output_0/kernel", "shape": [1, 1, 22, 3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "output_0/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}
