{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "33", "class_name": "ZeroPadding2D", "config": {"name": "33", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "65", "class_name": "ZeroPadding2D", "config": {"name": "65", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "97", "class_name": "ZeroPadding2D", "config": {"name": "97", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "129", "class_name": "ZeroPadding2D", "config": {"name": "129", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "34", "class_name": "AveragePooling2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "valid", "strides": [64, 64], "data_format": "channels_last"}, "inbound_nodes": [[["33", 0, 0, {}]]]}, {"name": "66", "class_name": "AveragePooling2D", "config": {"name": "66", "trainable": true, "dtype": "float32", "pool_size": [32, 32], "padding": "valid", "strides": [32, 32], "data_format": "channels_last"}, "inbound_nodes": [[["65", 0, 0, {}]]]}, {"name": "98", "class_name": "AveragePooling2D", "config": {"name": "98", "trainable": true, "dtype": "float32", "pool_size": [16, 16], "padding": "valid", "strides": [16, 16], "data_format": "channels_last"}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "130", "class_name": "AveragePooling2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "35", "class_name": "Conv2D", "config": {"name": "35", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["34", 0, 0, {}]]]}, {"name": "67", "class_name": "Conv2D", "config": {"name": "67", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["66", 0, 0, {}]]]}, {"name": "99", "class_name": "Conv2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["98", 0, 0, {}]]]}, {"name": "131", "class_name": "Conv2D", "config": {"name": "131", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "36", "class_name": "BatchNormalization", "config": {"name": "36", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["35", 0, 0, {}]]]}, {"name": "68", "class_name": "BatchNormalization", "config": {"name": "68", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["67", 0, 0, {}]]]}, {"name": "100", "class_name": "BatchNormalization", "config": {"name": "100", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["99", 0, 0, {}]]]}, {"name": "132", "class_name": "BatchNormalization", "config": {"name": "132", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["131", 0, 0, {}]]]}, {"name": "37", "class_name": "Activation", "config": {"name": "37", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["36", 0, 0, {}]]]}, {"name": "69", "class_name": "Activation", "config": {"name": "69", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["68", 0, 0, {}]]]}, {"name": "101", "class_name": "Activation", "config": {"name": "101", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "133", "class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["132", 0, 0, {}]]]}, {"name": "64", "class_name": "UpSampling2D", "config": {"name": "64", "trainable": true, "dtype": "float32", "size": [64, 64], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["37", 0, 0, {}]]]}, {"name": "96", "class_name": "UpSampling2D", "config": {"name": "96", "trainable": true, "dtype": "float32", "size": [32, 32], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["69", 0, 0, {}]]]}, {"name": "128", "class_name": "UpSampling2D", "config": {"name": "128", "trainable": true, "dtype": "float32", "size": [16, 16], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["101", 0, 0, {}]]]}, {"name": "160", "class_name": "UpSampling2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "size": [8, 8], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["133", 0, 0, {}]]]}, {"name": "161", "class_name": "Concatenate", "config": {"name": "161", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["input_0", 0, 0, {}], ["64", 0, 0, {}], ["96", 0, 0, {}], ["128", 0, 0, {}], ["160", 0, 0, {}]]]}, {"name": "162_pad", "class_name": "ZeroPadding2D", "config": {"name": "162_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["161", 0, 0, {}]]]}, {"name": "162", "class_name": "Conv2D", "config": {"name": "162", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["162_pad", 0, 0, {}]]]}, {"name": "163", "class_name": "BatchNormalization", "config": {"name": "163", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Activation", "config": {"name": "164", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["163", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Conv2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["164", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "100/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.29701822996139526, "scale": 0.0004893754042831122, "dtype": "uint8"}}, {"name": "100/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.022405292006099926, "scale": 0.00035008268759531135, "dtype": "uint8"}}, {"name": "100/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.2479172800101486, "scale": 0.008209982105329925, "dtype": "uint8"}}, {"name": "100/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.06655248254537582, "scale": 0.0007567639736568226, "dtype": "uint8"}}, {"name": "131/kernel", "shape": [1, 1, 512, 128], "dtype": "float32", "quantization": {"min": -0.0648171298644122, "scale": 0.000483709924361285, "dtype": "uint8"}}, {"name": "132/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.23588833212852478, "scale": 0.0003188938486809824, "dtype": "uint8"}}, {"name": "132/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.0311493977685185, "scale": 0.00020628740244051989, "dtype": "uint8"}}, {"name": "132/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.7704279843498678, "scale": 0.0064202332029155654, "dtype": "uint8"}}, {"name": "132/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.06375346332788467, "scale": 0.00040204153925764793, "dtype": "uint8"}}, {"name": "162/kernel", "shape": [3, 3, 1024, 128], "dtype": "float32", "quantization": {"min": -0.0874332361945919, "scale": 0.0006725633553430146, "dtype": "uint8"}}, {"name": "163/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.6327388882637024, "scale": 0.0016521858234031528, "dtype": "uint8"}}, {"name": "163/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.18793665223261888, "scale": 0.0023789449649698593, "dtype": "uint8"}}, {"name": "163/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.9609677253984938, "scale": 0.012651404679990283, "dtype": "uint8"}}, {"name": "163/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 1.596466064453125, "scale": 0.01972687852148916, "dtype": "uint8"}}, {"name": "35/kernel", "shape": [1, 1, 512, 128], "dtype": "float32", "quantization": {"min": -0.14064373899908628, "scale": 0.001065482871205199, "dtype": "uint8"}}, {"name": "36/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.4456608295440674, "scale": 0.0007654802471983666, "dtype": "uint8"}}, {"name": "36/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.06203520324300317, "scale": 0.000984685765761955, "dtype": "uint8"}}, {"name": "36/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.725574710789849, "scale": 0.010852671137043074, "dtype": "uint8"}}, {"name": "36/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.09398973733186722, "scale": 0.0009982155526385588, "dtype": "uint8"}}, {"name": "67/kernel", "shape": [1, 1, 512, 128], "dtype": "float32", "quantization": {"min": -0.08003515320665697, "scale": 0.0006351996286242616, "dtype": "uint8"}}, {"name": "68/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.3297676146030426, "scale": 0.0004783934237910252, "dtype": "uint8"}}, {"name": "68/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.02002104244687978, "scale": 0.0004883181084604824, "dtype": "uint8"}}, {"name": "68/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.1926012394475, "scale": 0.008339868807325176, "dtype": "uint8"}}, {"name": "68/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.04853332042694092, "scale": 0.0005070295403985417, "dtype": "uint8"}}, {"name": "99/kernel", "shape": [1, 1, 512, 128], "dtype": "float32", "quantization": {"min": -0.07591484951622346, "scale": 0.0005884872055521199, "dtype": "uint8"}}, {"name": "output_0/kernel", "shape": [1, 1, 128, 21], "dtype": "float32", "quantization": {"min": -0.8682700641014997, "scale": 0.0069461605128119976, "dtype": "uint8"}}, {"name": "output_0/bias", "shape": [21], "dtype": "float32", "quantization": {"min": -0.08537704249223074, "scale": 0.001004435794026244, "dtype": "uint8"}}]}]}