{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "65", "class_name": "ZeroPadding2D", "config": {"name": "65", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "66", "class_name": "DepthwiseConv2D", "config": {"name": "66", "trainable": true, "dtype": "float32", "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["65", 0, 0, {}]]]}, {"name": "67", "class_name": "Conv2D", "config": {"name": "67", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["66", 0, 0, {}]]]}, {"name": "68", "class_name": "Activation", "config": {"name": "68", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["67", 0, 0, {}]]]}, {"name": "69", "class_name": "ZeroPadding2D", "config": {"name": "69", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["68", 0, 0, {}]]]}, {"name": "70", "class_name": "DepthwiseConv2D", "config": {"name": "70", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["69", 0, 0, {}]]]}, {"name": "71", "class_name": "Conv2D", "config": {"name": "71", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["70", 0, 0, {}]]]}, {"name": "72", "class_name": "Activation", "config": {"name": "72", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["71", 0, 0, {}]]]}, {"name": "73", "class_name": "ZeroPadding2D", "config": {"name": "73", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["72", 0, 0, {}]]]}, {"name": "74", "class_name": "DepthwiseConv2D", "config": {"name": "74", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["73", 0, 0, {}]]]}, {"name": "75", "class_name": "Conv2D", "config": {"name": "75", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["74", 0, 0, {}]]]}, {"name": "76", "class_name": "Activation", "config": {"name": "76", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["75", 0, 0, {}]]]}, {"name": "77", "class_name": "ZeroPadding2D", "config": {"name": "77", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["76", 0, 0, {}]]]}, {"name": "78", "class_name": "DepthwiseConv2D", "config": {"name": "78", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["77", 0, 0, {}]]]}, {"name": "79", "class_name": "Conv2D", "config": {"name": "79", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["78", 0, 0, {}]]]}, {"name": "80", "class_name": "Activation", "config": {"name": "80", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["79", 0, 0, {}]]]}, {"name": "81", "class_name": "ZeroPadding2D", "config": {"name": "81", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["80", 0, 0, {}]]]}, {"name": "82", "class_name": "DepthwiseConv2D", "config": {"name": "82", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["81", 0, 0, {}]]]}, {"name": "83", "class_name": "Conv2D", "config": {"name": "83", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["82", 0, 0, {}]]]}, {"name": "84", "class_name": "Add", "config": {"name": "84", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["83", 0, 0, {}], ["76", 0, 0, {}]]]}, {"name": "85", "class_name": "ZeroPadding2D", "config": {"name": "85", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["84", 0, 0, {}]]]}, {"name": "86", "class_name": "DepthwiseConv2D", "config": {"name": "86", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["85", 0, 0, {}]]]}, {"name": "87", "class_name": "Conv2D", "config": {"name": "87", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["86", 0, 0, {}]]]}, {"name": "88", "class_name": "Activation", "config": {"name": "88", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["87", 0, 0, {}]]]}, {"name": "89", "class_name": "ZeroPadding2D", "config": {"name": "89", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["88", 0, 0, {}]]]}, {"name": "90", "class_name": "DepthwiseConv2D", "config": {"name": "90", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["89", 0, 0, {}]]]}, {"name": "91", "class_name": "Conv2D", "config": {"name": "91", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["90", 0, 0, {}]]]}, {"name": "92", "class_name": "Add", "config": {"name": "92", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["91", 0, 0, {}], ["84", 0, 0, {}]]]}, {"name": "93", "class_name": "ZeroPadding2D", "config": {"name": "93", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["92", 0, 0, {}]]]}, {"name": "94", "class_name": "DepthwiseConv2D", "config": {"name": "94", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["93", 0, 0, {}]]]}, {"name": "95", "class_name": "Conv2D", "config": {"name": "95", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["94", 0, 0, {}]]]}, {"name": "96", "class_name": "Activation", "config": {"name": "96", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["95", 0, 0, {}]]]}, {"name": "97", "class_name": "ZeroPadding2D", "config": {"name": "97", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["96", 0, 0, {}]]]}, {"name": "98", "class_name": "DepthwiseConv2D", "config": {"name": "98", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["97", 0, 0, {}]]]}, {"name": "99", "class_name": "Conv2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["98", 0, 0, {}]]]}, {"name": "100", "class_name": "Add", "config": {"name": "100", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["99", 0, 0, {}], ["92", 0, 0, {}]]]}, {"name": "101", "class_name": "ZeroPadding2D", "config": {"name": "101", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["100", 0, 0, {}]]]}, {"name": "102", "class_name": "DepthwiseConv2D", "config": {"name": "102", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["101", 0, 0, {}]]]}, {"name": "103", "class_name": "Conv2D", "config": {"name": "103", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["102", 0, 0, {}]]]}, {"name": "104", "class_name": "Activation", "config": {"name": "104", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["103", 0, 0, {}]]]}, {"name": "105", "class_name": "ZeroPadding2D", "config": {"name": "105", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["104", 0, 0, {}]]]}, {"name": "106", "class_name": "DepthwiseConv2D", "config": {"name": "106", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["105", 0, 0, {}]]]}, {"name": "107", "class_name": "Conv2D", "config": {"name": "107", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["106", 0, 0, {}]]]}, {"name": "108", "class_name": "Add", "config": {"name": "108", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["107", 0, 0, {}], ["100", 0, 0, {}]]]}, {"name": "109", "class_name": "ZeroPadding2D", "config": {"name": "109", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["108", 0, 0, {}]]]}, {"name": "110", "class_name": "DepthwiseConv2D", "config": {"name": "110", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["109", 0, 0, {}]]]}, {"name": "111", "class_name": "Conv2D", "config": {"name": "111", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["110", 0, 0, {}]]]}, {"name": "112", "class_name": "Activation", "config": {"name": "112", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["111", 0, 0, {}]]]}, {"name": "113", "class_name": "ZeroPadding2D", "config": {"name": "113", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["112", 0, 0, {}]]]}, {"name": "114", "class_name": "DepthwiseConv2D", "config": {"name": "114", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["113", 0, 0, {}]]]}, {"name": "115", "class_name": "Conv2D", "config": {"name": "115", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["114", 0, 0, {}]]]}, {"name": "116", "class_name": "Add", "config": {"name": "116", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["115", 0, 0, {}], ["108", 0, 0, {}]]]}, {"name": "143", "class_name": "UpSampling2D", "config": {"name": "143", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["116", 0, 0, {}]]]}, {"name": "144", "class_name": "ZeroPadding2D", "config": {"name": "144", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "145", "class_name": "DepthwiseConv2D", "config": {"name": "145", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["144", 0, 0, {}]]]}, {"name": "146", "class_name": "Conv2D", "config": {"name": "146", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["145", 0, 0, {}]]]}, {"name": "147", "class_name": "Activation", "config": {"name": "147", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["146", 0, 0, {}]]]}, {"name": "174", "class_name": "UpSampling2D", "config": {"name": "174", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["147", 0, 0, {}]]]}, {"name": "175", "class_name": "ZeroPadding2D", "config": {"name": "175", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "176", "class_name": "DepthwiseConv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "177", "class_name": "Conv2D", "config": {"name": "177", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "178", "class_name": "Activation", "config": {"name": "178", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["177", 0, 0, {}]]]}, {"name": "179", "class_name": "ZeroPadding2D", "config": {"name": "179", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "DepthwiseConv2D", "config": {"name": "180", "trainable": true, "dtype": "float32", "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["179", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Conv2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["180", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "102/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "102/bias", "shape": [128], "dtype": "float32"}, {"name": "103/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "103/bias", "shape": [128], "dtype": "float32"}, {"name": "106/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "106/bias", "shape": [128], "dtype": "float32"}, {"name": "107/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "107/bias", "shape": [128], "dtype": "float32"}, {"name": "110/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "110/bias", "shape": [128], "dtype": "float32"}, {"name": "111/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "111/bias", "shape": [128], "dtype": "float32"}, {"name": "114/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "114/bias", "shape": [128], "dtype": "float32"}, {"name": "115/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "115/bias", "shape": [128], "dtype": "float32"}, {"name": "145/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "145/bias", "shape": [128], "dtype": "float32"}, {"name": "146/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "146/bias", "shape": [64], "dtype": "float32"}, {"name": "176/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "176/bias", "shape": [64], "dtype": "float32"}, {"name": "177/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "177/bias", "shape": [32], "dtype": "float32"}, {"name": "180/depthwise_kernel", "shape": [9, 9, 32, 1], "dtype": "float32"}, {"name": "180/bias", "shape": [32], "dtype": "float32"}, {"name": "66/depthwise_kernel", "shape": [9, 9, 3, 1], "dtype": "float32"}, {"name": "66/bias", "shape": [3], "dtype": "float32"}, {"name": "67/kernel", "shape": [1, 1, 3, 32], "dtype": "float32"}, {"name": "67/bias", "shape": [32], "dtype": "float32"}, {"name": "70/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "70/bias", "shape": [32], "dtype": "float32"}, {"name": "71/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "71/bias", "shape": [64], "dtype": "float32"}, {"name": "74/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "74/bias", "shape": [64], "dtype": "float32"}, {"name": "75/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "75/bias", "shape": [128], "dtype": "float32"}, {"name": "78/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "78/bias", "shape": [128], "dtype": "float32"}, {"name": "79/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "79/bias", "shape": [128], "dtype": "float32"}, {"name": "82/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "82/bias", "shape": [128], "dtype": "float32"}, {"name": "83/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "83/bias", "shape": [128], "dtype": "float32"}, {"name": "86/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "86/bias", "shape": [128], "dtype": "float32"}, {"name": "87/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "87/bias", "shape": [128], "dtype": "float32"}, {"name": "90/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "90/bias", "shape": [128], "dtype": "float32"}, {"name": "91/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "91/bias", "shape": [128], "dtype": "float32"}, {"name": "94/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "94/bias", "shape": [128], "dtype": "float32"}, {"name": "95/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "95/bias", "shape": [128], "dtype": "float32"}, {"name": "98/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "98/bias", "shape": [128], "dtype": "float32"}, {"name": "99/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "99/bias", "shape": [128], "dtype": "float32"}, {"name": "output_0/kernel", "shape": [1, 1, 32, 3], "dtype": "float32"}, {"name": "output_0/bias", "shape": [3], "dtype": "float32"}]}]}