{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "2", "class_name": "MirrorPad", "config": {"name": "2", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 5]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Conv2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [11, 11], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["2", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "output_0/kernel", "shape": [11, 11, 1, 1], "dtype": "float32"}]}]}
