{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "303_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "303_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "303", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "303", "inbound_nodes": [[["303_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "304", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "304", "inbound_nodes": [[["303", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "output_0", "inbound_nodes": [[["304", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "306_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "306_pad", "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "306", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "306", "inbound_nodes": [[["306_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "307", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "307", "inbound_nodes": [[["306", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "308", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "308", "inbound_nodes": [[["307", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "309", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "309", "inbound_nodes": [[["308", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "310", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "310", "inbound_nodes": [[["309", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "311", "trainable": true, "dtype": "float32"}, "name": "311", "inbound_nodes": [[["output_0", 0, 0, {}], ["310", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "312", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "312", "inbound_nodes": [[["311", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "313", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "313", "inbound_nodes": [[["312", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "314", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "314", "inbound_nodes": [[["313", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "315_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "315_pad", "inbound_nodes": [[["314", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "315", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "315", "inbound_nodes": [[["315_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "316", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "316", "inbound_nodes": [[["315", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "317", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "317", "inbound_nodes": [[["316", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "318", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "318", "inbound_nodes": [[["317", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "output_1", "inbound_nodes": [[["318", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "320", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "320", "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "321", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "321", "inbound_nodes": [[["320", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "322", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "322", "inbound_nodes": [[["321", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "323_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "323_pad", "inbound_nodes": [[["322", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "323", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "323", "inbound_nodes": [[["323_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "324", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "324", "inbound_nodes": [[["323", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "325", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "325", "inbound_nodes": [[["324", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "326", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "326", "inbound_nodes": [[["325", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "327", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "327", "inbound_nodes": [[["326", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "328", "trainable": true, "dtype": "float32"}, "name": "328", "inbound_nodes": [[["output_1", 0, 0, {}], ["327", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "329", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "329", "inbound_nodes": [[["328", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "330", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "330", "inbound_nodes": [[["329", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "331", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "331", "inbound_nodes": [[["330", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "332_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "332_pad", "inbound_nodes": [[["331", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "332", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "332", "inbound_nodes": [[["332_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "333", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "333", "inbound_nodes": [[["332", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "340", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "340", "inbound_nodes": [[["333", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "341_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "341_pad", "inbound_nodes": [[["340", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "341", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "name": "341", "inbound_nodes": [[["341_pad", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "345", "trainable": true, "dtype": "float32", "target_shape": [72]}, "name": "345", "inbound_nodes": [[["341", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "346", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "346", "inbound_nodes": [[["345", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "347", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "347", "inbound_nodes": [[["346", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "348", "trainable": true, "dtype": "float32", "units": 72, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "348", "inbound_nodes": [[["347", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "349", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "349", "inbound_nodes": [[["348", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "357", "trainable": true, "dtype": "float32", "target_shape": [72, 1, 1]}, "name": "357", "inbound_nodes": [[["349", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "358", "trainable": true, "dtype": "float32"}, "name": "358", "inbound_nodes": [[["333", 0, 0, {}], ["357", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "359", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "359", "inbound_nodes": [[["358", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "360", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "360", "inbound_nodes": [[["359", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "361", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "361", "inbound_nodes": [[["360", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "362", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "362", "inbound_nodes": [[["361", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "363", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "363", "inbound_nodes": [[["362", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "364", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "364", "inbound_nodes": [[["363", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "365_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "365_pad", "inbound_nodes": [[["364", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "365", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "365", "inbound_nodes": [[["365_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "366", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "366", "inbound_nodes": [[["365", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "373", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "373", "inbound_nodes": [[["366", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "374_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "374_pad", "inbound_nodes": [[["373", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "374", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "name": "374", "inbound_nodes": [[["374_pad", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "378", "trainable": true, "dtype": "float32", "target_shape": [120]}, "name": "378", "inbound_nodes": [[["374", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "379", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "379", "inbound_nodes": [[["378", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "380", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "380", "inbound_nodes": [[["379", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "381", "trainable": true, "dtype": "float32", "units": 120, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "381", "inbound_nodes": [[["380", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "382", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "382", "inbound_nodes": [[["381", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "390", "trainable": true, "dtype": "float32", "target_shape": [120, 1, 1]}, "name": "390", "inbound_nodes": [[["382", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "391", "trainable": true, "dtype": "float32"}, "name": "391", "inbound_nodes": [[["366", 0, 0, {}], ["390", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "392", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "392", "inbound_nodes": [[["391", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "393", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "393", "inbound_nodes": [[["392", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "394", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "394", "inbound_nodes": [[["393", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "output_2", "trainable": true, "dtype": "float32"}, "name": "output_2", "inbound_nodes": [[["361", 0, 0, {}], ["394", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "396", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "396", "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "397", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "397", "inbound_nodes": [[["396", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "398", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "398", "inbound_nodes": [[["397", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "399_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "399_pad", "inbound_nodes": [[["398", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "399", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "399", "inbound_nodes": [[["399_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "400", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "400", "inbound_nodes": [[["399", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "407", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "407", "inbound_nodes": [[["400", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "408_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "408_pad", "inbound_nodes": [[["407", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "408", "trainable": true, "dtype": "float32", "pool_size": [56, 56], "padding": "valid", "strides": [56, 56], "data_format": "channels_first"}, "name": "408", "inbound_nodes": [[["408_pad", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "412", "trainable": true, "dtype": "float32", "target_shape": [120]}, "name": "412", "inbound_nodes": [[["408", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "413", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "413", "inbound_nodes": [[["412", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "414", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "414", "inbound_nodes": [[["413", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "415", "trainable": true, "dtype": "float32", "units": 120, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "415", "inbound_nodes": [[["414", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "416", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "416", "inbound_nodes": [[["415", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "424", "trainable": true, "dtype": "float32", "target_shape": [120, 1, 1]}, "name": "424", "inbound_nodes": [[["416", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "425", "trainable": true, "dtype": "float32"}, "name": "425", "inbound_nodes": [[["400", 0, 0, {}], ["424", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "426", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "426", "inbound_nodes": [[["425", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "427", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "427", "inbound_nodes": [[["426", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "428", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "428", "inbound_nodes": [[["427", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "429", "trainable": true, "dtype": "float32"}, "name": "429", "inbound_nodes": [[["output_2", 0, 0, {}], ["428", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "430", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "430", "inbound_nodes": [[["429", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "431", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "431", "inbound_nodes": [[["430", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "432", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "432", "inbound_nodes": [[["431", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "433_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "433_pad", "inbound_nodes": [[["432", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "433", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "433", "inbound_nodes": [[["433_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "434", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "434", "inbound_nodes": [[["433", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "435", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "435", "inbound_nodes": [[["434", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "436", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "436", "inbound_nodes": [[["435", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "437", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "437", "inbound_nodes": [[["436", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "438", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "438", "inbound_nodes": [[["437", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "439", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "439", "inbound_nodes": [[["438", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "440", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "440", "inbound_nodes": [[["439", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "441_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "441_pad", "inbound_nodes": [[["440", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "441", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "441", "inbound_nodes": [[["441_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "442", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "442", "inbound_nodes": [[["441", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "443", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "443", "inbound_nodes": [[["442", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "444", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "444", "inbound_nodes": [[["443", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "445", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "445", "inbound_nodes": [[["444", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "446", "trainable": true, "dtype": "float32"}, "name": "446", "inbound_nodes": [[["437", 0, 0, {}], ["445", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "447", "trainable": true, "dtype": "float32", "filters": 184, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "447", "inbound_nodes": [[["446", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "448", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "448", "inbound_nodes": [[["447", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "449", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "449", "inbound_nodes": [[["448", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "450_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "450_pad", "inbound_nodes": [[["449", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "450", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "450", "inbound_nodes": [[["450_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "451", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "451", "inbound_nodes": [[["450", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "452", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "452", "inbound_nodes": [[["451", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "453", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "453", "inbound_nodes": [[["452", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "454", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "454", "inbound_nodes": [[["453", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "455", "trainable": true, "dtype": "float32"}, "name": "455", "inbound_nodes": [[["446", 0, 0, {}], ["454", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "456", "trainable": true, "dtype": "float32", "filters": 184, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "456", "inbound_nodes": [[["455", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "457", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "457", "inbound_nodes": [[["456", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "458", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "458", "inbound_nodes": [[["457", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "459_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "459_pad", "inbound_nodes": [[["458", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "459", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "459", "inbound_nodes": [[["459_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "460", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": 