{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "123_pad", "class_name": "ZeroPadding2D", "config": {"name": "123_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "123", "class_name": "Conv2D", "config": {"name": "123", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["123_pad", 0, 0, {}]]]}, {"name": "124", "class_name": "BatchNormalization", "config": {"name": "124", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["123", 0, 0, {}]]]}, {"name": "output_0", "class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["124", 0, 0, {}]]]}, {"name": "126_pad", "class_name": "ZeroPadding2D", "config": {"name": "126_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"name": "126", "class_name": "MaxPooling2D", "config": {"name": "126", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["126_pad", 0, 0, {}]]]}, {"name": "127_pad", "class_name": "ZeroPadding2D", "config": {"name": "127_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["126", 0, 0, {}]]]}, {"name": "127", "class_name": "Conv2D", "config": {"name": "127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["127_pad", 0, 0, {}]]]}, {"name": "128", "class_name": "BatchNormalization", "config": {"name": "128", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["127", 0, 0, {}]]]}, {"name": "129", "class_name": "Activation", "config": {"name": "129", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["128", 0, 0, {}]]]}, {"name": "130_pad", "class_name": "ZeroPadding2D", "config": {"name": "130_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["129", 0, 0, {}]]]}, {"name": "130", "class_name": "Conv2D", "config": {"name": "130", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["130_pad", 0, 0, {}]]]}, {"name": "131", "class_name": "BatchNormalization", "config": {"name": "131", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["130", 0, 0, {}]]]}, {"name": "132", "class_name": "Add", "config": {"name": "132", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["131", 0, 0, {}], ["126", 0, 0, {}]]]}, {"name": "133", "class_name": "Activation", "config": {"name": "133", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["132", 0, 0, {}]]]}, {"name": "134_pad", "class_name": "ZeroPadding2D", "config": {"name": "134_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["133", 0, 0, {}]]]}, {"name": "134", "class_name": "Conv2D", "config": {"name": "134", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["134_pad", 0, 0, {}]]]}, {"name": "135", "class_name": "BatchNormalization", "config": {"name": "135", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["134", 0, 0, {}]]]}, {"name": "136", "class_name": "Activation", "config": {"name": "136", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["135", 0, 0, {}]]]}, {"name": "137_pad", "class_name": "ZeroPadding2D", "config": {"name": "137_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["136", 0, 0, {}]]]}, {"name": "137", "class_name": "Conv2D", "config": {"name": "137", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["137_pad", 0, 0, {}]]]}, {"name": "138", "class_name": "BatchNormalization", "config": {"name": "138", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["137", 0, 0, {}]]]}, {"name": "139", "class_name": "Add", "config": {"name": "139", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["138", 0, 0, {}], ["133", 0, 0, {}]]]}, {"name": "output_1", "class_name": "Activation", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["139", 0, 0, {}]]]}, {"name": "141_pad", "class_name": "ZeroPadding2D", "config": {"name": "141_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "141", "class_name": "Conv2D", "config": {"name": "141", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["141_pad", 0, 0, {}]]]}, {"name": "142", "class_name": "BatchNormalization", "config": {"name": "142", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["141", 0, 0, {}]]]}, {"name": "143", "class_name": "Activation", "config": {"name": "143", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["142", 0, 0, {}]]]}, {"name": "144_pad", "class_name": "ZeroPadding2D", "config": {"name": "144_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["143", 0, 0, {}]]]}, {"name": "144", "class_name": "Conv2D", "config": {"name": "144", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["144_pad", 0, 0, {}]]]}, {"name": "146", "class_name": "Conv2D", "config": {"name": "146", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_1", 0, 0, {}]]]}, {"name": "145", "class_name": "BatchNormalization", "config": {"name": "145", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["144", 0, 0, {}]]]}, {"name": "147", "class_name": "BatchNormalization", "config": {"name": "147", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["146", 0, 0, {}]]]}, {"name": "148", "class_name": "Add", "config": {"name": "148", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["145", 0, 0, {}], ["147", 0, 0, {}]]]}, {"name": "149", "class_name": "Activation", "config": {"name": "149", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["148", 0, 0, {}]]]}, {"name": "150_pad", "class_name": "ZeroPadding2D", "config": {"name": "150_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["149", 0, 0, {}]]]}, {"name": "150", "class_name": "Conv2D", "config": {"name": "150", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["150_pad", 0, 0, {}]]]}, {"name": "151", "class_name": "BatchNormalization", "config": {"name": "151", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["150", 0, 0, {}]]]}, {"name": "152", "class_name": "Activation", "config": {"name": "152", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["151", 0, 0, {}]]]}, {"name": "153_pad", "class_name": "ZeroPadding2D", "config": {"name": "153_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["152", 0, 0, {}]]]}, {"name": "153", "class_name": "Conv2D", "config": {"name": "153", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["153_pad", 0, 0, {}]]]}, {"name": "154", "class_name": "BatchNormalization", "config": {"name": "154", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["153", 0, 0, {}]]]}, {"name": "155", "class_name": "Add", "config": {"name": "155", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["154", 0, 0, {}], ["149", 0, 0, {}]]]}, {"name": "output_2", "class_name": "Activation", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["155", 0, 0, {}]]]}, {"name": "157_pad", "class_name": "ZeroPadding2D", "config": {"name": "157_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "157", "class_name": "Conv2D", "config": {"name": "157", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["157_pad", 0, 0, {}]]]}, {"name": "158", "class_name": "BatchNormalization", "config": {"name": "158", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["157", 0, 0, {}]]]}, {"name": "159", "class_name": "Activation", "config": {"name": "159", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["158", 0, 0, {}]]]}, {"name": "160_pad", "class_name": "ZeroPadding2D", "config": {"name": "160_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["159", 0, 0, {}]]]}, {"name": "160", "class_name": "Conv2D", "config": {"name": "160", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["160_pad", 0, 0, {}]]]}, {"name": "162", "class_name": "Conv2D", "config": {"name": "162", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_2", 0, 0, {}]]]}, {"name": "161", "class_name": "BatchNormalization", "config": {"name": "161", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["160", 0, 0, {}]]]}, {"name": "163", "class_name": "BatchNormalization", "config": {"name": "163", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["162", 0, 0, {}]]]}, {"name": "164", "class_name": "Add", "config": {"name": "164", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["161", 0, 0, {}], ["163", 0, 0, {}]]]}, {"name": "165", "class_name": "Activation", "config": {"name": "165", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["164", 0, 0, {}]]]}, {"name": "166_pad", "class_name": "ZeroPadding2D", "config": {"name": "166_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["165", 0, 0, {}]]]}, {"name": "166", "class_name": "Conv2D", "config": {"name": "166", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["166_pad", 0, 0, {}]]]}, {"name": "167", "class_name": "BatchNormalization", "config": {"name": "167", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["166", 0, 0, {}]]]}, {"name": "168", "class_name": "Activation", "config": {"name": "168", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["167", 0, 0, {}]]]}, {"name": "169_pad", "class_name": "ZeroPadding2D", "config": {"name": "169_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["168", 0, 0, {}]]]}, {"name": "169", "class_name": "Conv2D", "config": {"name": "169", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["169_pad", 0, 0, {}]]]}, {"name": "170", "class_name": "BatchNormalization", "config": {"name": "170", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["169", 0, 0, {}]]]}, {"name": "171", "class_name": "Add", "config": {"name": "171", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["170", 0, 0, {}], ["165", 0, 0, {}]]]}, {"name": "output_3", "class_name": "Activation", "config": {"name": "output_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["171", 0, 0, {}]]]}, {"name": "173_pad", "class_name": "ZeroPadding2D", "config": {"name": "173_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "173", "class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["173_pad", 0, 0, {}]]]}, {"name": "174", "class_name": "BatchNormalization", "config": {"name": "174", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["173", 0, 0, {}]]]}, {"name": "175", "class_name": "Activation", "config": {"name": "175", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["174", 0, 0, {}]]]}, {"name": "176_pad", "class_name": "ZeroPadding2D", "config": {"name": "176_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["175", 0, 0, {}]]]}, {"name": "176", "class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["176_pad", 0, 0, {}]]]}, {"name": "178", "class_name": "Conv2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["output_3", 0, 0, {}]]]}, {"name": "177", "class_name": "BatchNormalization", "config": {"name": "177", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["176", 0, 0, {}]]]}, {"name": "179", "class_name": "BatchNormalization", "config": {"name": "179", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["178", 0, 0, {}]]]}, {"name": "180", "class_name": "Add", "config": {"name": "180", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["177", 0, 0, {}], ["179", 0, 0, {}]]]}, {"name": "181", "class_name": "Activation", "config": {"name": "181", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["180", 0, 0, {}]]]}, {"name": "182_pad", "class_name": "ZeroPadding2D", "config": {"name": "182_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["181", 0, 0, {}]]]}, {"name": "182", "class_name": "Conv2D", "config": {"name": "182", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["182_pad", 0, 0, {}]]]}, {"name": "183", "class_name": "BatchNormalization", "config": {"name": "183", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["182", 0, 0, {}]]]}, {"name": "184", "class_name": "Activation", "config": {"name": "184", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["183", 0, 0, {}]]]}, {"name": "185_pad", "class_name": "ZeroPadding2D", "config": {"name": "185_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["184", 0, 0, {}]]]}, {"name": "185", "class_name": "Conv2D", "config": {"name": "185", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["185_pad", 0, 0, {}]]]}, {"name": "186", "class_name": "BatchNormalization", "config": {"name": "186", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["185", 0, 0, {}]]]}, {"name": "187", "class_name": "Add", "config": {"name": "187", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["186", 0, 0, {}], ["181", 0, 0, {}]]]}, {"name": "output_4", "class_name": "Activation", "config": {"name": "output_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["187", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0], ["output_3", 0, 0], ["output_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "123/kernel", "shape": [7, 7, 3, 64], "dtype": "float32", "quantization": {"min": -0.749464880251417, "scale": 0.006460904140098422, "dtype": "uint8"}}, {"name": "124/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0, "scale": 0.00214236267397785, "dtype": "uint8"}}, {"name": "124/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5536227067311604, "scale": 0.004652291653203029, "dtype": "uint8"}}, {"name": "124/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.5384987806572634, "scale": 0.0037657257388619817, "dtype": "uint8"}}, {"name": "124/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 8.869937255387775e-14, "scale": 0.041973581501081526, "dtype": "uint8"}}, {"name": "127/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.6880789177090514, "scale": 0.00491484941220751, "dtype": "uint8"}}, {"name": "128/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.142903134226799, "scale": 0.0018038189294291478, "dtype": "uint8"}}, {"name": "128/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.47325907945632933, "scale": 0.0030931965977537865, "dtype": "uint8"}}, {"name": "128/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.540077059876685, "scale": 0.014190374636182598, "dtype": "uint8"}}, {"name": "128/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0252944678068161, "scale": 0.004611753774624245, "dtype": "uint8"}}, {"name": "130/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.4376578120624318, "scale": 0.0027183715034933653, "dtype": "uint8"}}, {"name": "131/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.06445003300905228, "scale": 0.0019841691734744055, "dtype": "uint8"}}, {"name": "131/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.37707427249235265, "scale": 0.0032506402801064883, "dtype": "uint8"}}, {"name": "131/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.49917479309381224, "scale": 0.0044569177954804666, "dtype": "uint8"}}, {"name": "131/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.014651925303041935, "scale": 0.0010609946962372929, "dtype": "uint8"}}, {"name": "134/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.5231526318718406, "scale": 0.004359605265598671, "dtype": "uint8"}}, {"name": "135/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.1527635157108307, "scale": 0.00105629797075309, "dtype": "uint8"}}, {"name": "135/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.46126142436382817, "scale": 0.0026357795677933037, "dtype": "uint8"}}, {"name": "135/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -2.4871317713868386, "scale": 0.0135170204966676, "dtype": "uint8"}}, {"name": "135/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.05796217545866966, "scale": 0.0019476741114083458, "dtype": "uint8"}}, {"name": "137/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.32183750657474297, "scale": 0.002332155844744514, "dtype": "uint8"}}, {"name": "138/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.05230136215686798, "scale": 0.0022287812303094304, "dtype": "uint8"}}, {"name": "138/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.39269310586592726, "scale": 0.002617954039106182, "dtype": "uint8"}}, {"name": "138/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.467731749310213, "scale": 0.0043308495306501205, "dtype": "uint8"}}, {"name": "138/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.010033623315393925, "scale": 0.00041277060540867785, "dtype": "uint8"}}, {"name": "141/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.2882558487209619, "scale": 0.002306046789767695, "dtype": "uint8"}}, {"name": "142/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.1051354706287384, "scale": 0.0009768138913547292, "dtype": "uint8"}}, {"name": "142/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.3182125617476071, "scale": 0.0030305958261676864, "dtype": "uint8"}}, {"name": "142/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.5495442843904683, "scale": 0.008513979584563012, "dtype": "uint8"}}, {"name": "142/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.07431450486183167, "scale": 0.0024112050439797196, "dtype": "uint8"}}, {"name": "144/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.30446158016429226, "scale": 0.002624668794519761, "dtype": "uint8"}}, {"name": "145/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.08953743427991867, "scale": 0.0017058197481959474, "dtype": "uint8"}}, {"name": "145/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.27234870844027576, "scale": 0.001630830589462729, "dtype": "uint8"}}, {"name": "145/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.7214234376654906, "scale": 0.003718677513739642, "dtype": "uint8"}}, {"name": "145/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.014162878505885601, "scale": 0.0005805989289108445, "dtype": "uint8"}}, {"name": "146/kernel", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"min": -0.709071513484506, "scale": 0.005496678399104698, "dtype": "uint8"}}, {"name": "147/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": -0.0019477210441312077, "scale": 0.0019477210441312077, "dtype": "uint8"}}, {"name": "147/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.27234870844027576, "scale": 0.001630830589462729, "dtype": "uint8"}}, {"name": "147/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.7107712177669301, "scale": 0.007037338789771585, "dtype": "uint8"}}, {"name": "147/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.0031459922902286053, "scale": 0.0004868953853991686, "dtype": "uint8"}}, {"name": "150/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.34038867669947004, "scale": 0.002836572305828917, "dtype": "uint8"}}, {"name": "151/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.16169649362564087, "scale": 0.0009465316931406657, "dtype": "uint8"}}, {"name": "151/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.6294811964035034, "scale": 0.0023269004243261673, "dtype": "uint8"}}, {"name": "151/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -1.0868260103113512, "scale": 0.007547402849384383, "dtype": "uint8"}}, {"name": "151/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.05635329335927963, "scale": 0.0011394096647991854, "dtype": "uint8"}}, {"name": "153/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.285180439785415, "scale": 0.0023568631387224383, "dtype": "uint8"}}, {"name": "154/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.07222658395767212, "scale": 0.0019572162160686416, "dtype": "uint8"}}, {"name": "154/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.48308942914009095, "scale": 0.0031574472492816403, "dtype": "uint8"}}, {"name": "154/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.41450746667151356, "scale": 0.0033428021505767223, "dtype": "uint8"}}, {"name": "154/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.008446716703474522, "scale": 0.00019348337881120982, "dtype": "uint8"}}, {"name": "157/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.3444483280181885, "scale": 0.002570509910583496, "dtype": "uint8"}}, {"name": "158/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.17189615964889526, "scale": 0.0011991579158633363, "dtype": "uint8"}}, {"name": "158/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.39904727649454974, "scale": 0.0022046810856052473, "dtype": "uint8"}}, {"name": "158/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -1.220721923603731, "scale": 0.007266201926212685, "dtype": "uint8"}}, {"name": "158/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.07596061378717422, "scale": 0.0018133870234676435, "dtype": "uint8"}}, {"name": "160/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.2846628376081878, "scale": 0.002223928418813967, "dtype": "uint8"}}, {"name": "161/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.111269511282444, "scale": 0.002130551986834582, "dtype": "uint8"}}, {"name": "161/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.31417314725763656, "scale": 0.001870078257485932, "dtype": "uint8"}}, {"name": "161/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.5615959472516003, "scale": 0.0032841868260327506, "dtype": "uint8"}}, {"name": "161/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.02541043423116207, "scale": 0.0006392628319707571, "dtype": "uint8"}}, {"name": "162/kernel", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"min": -0.2279729054254644, "scale": 0.0017950622474446015, "dtype": "uint8"}}, {"name": "163/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": -0.008103743414668475, "scale": 0.001350623902444746, "dtype": "uint8"}}, {"name": "163/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.31417314725763656, "scale": 0.001870078257485932, "dtype": "uint8"}}, {"name": "163/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.24780108455349417, "scale": 0.0015202520524754243, "dtype": "uint8"}}, {"name": "163/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.0018462411826476455, "scale": 7.572943098185694e-05, "dtype": "uint8"}}, {"name": "166/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.2631950019037022, "scale": 0.0019495926066940906, "dtype": "uint8"}}, {"name": "167/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.10698088258504868, "scale": 0.0017161078604997374, "dtype": "uint8"}}, {"name": "167/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.598675919806256, "scale": 0.003236086053006789, "dtype": "uint8"}}, {"name": "167/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.7583165037865732, "scale": 0.0064264110490387565, "dtype": "uint8"}}, {"name": "167/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.030334141105413437, "scale": 0.0006696542250175102, "dtype": "uint8"}}, {"name": "169/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.25032441756304574, "scale": 0.0026075460162817265, "dtype": "uint8"}}, {"name": "170/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.07700742781162262, "scale": 0.0024042519284229653, "dtype": "uint8"}}, {"name": "170/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.6181235032923081, "scale": 0.003359366865719066, "dtype": "uint8"}}, {"name": "170/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -0.6712941422181972, "scale": 0.004629614773918601, "dtype": "uint8"}}, {"name": "170/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 0.004531941842287779, "scale": 0.0002905358596905774, "dtype": "uint8"}}, {"name": "173/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.21618896839665433, "scale": 0.0021618896839665433, "dtype": "uint8"}}, {"name": "174/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.11933299899101257, "scale": 0.0009446519262650434, "dtype": "uint8"}}, {"name": "174/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4367997626463572, "scale": 0.0023358276077345306, "dtype": "uint8"}}, {"name": "174/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -1.1979052085502473, "scale": 0.00855646577535891, "dtype": "uint8"}}, {"name": "174/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.042646925896406174, "scale": 0.0007480373131293877, "dtype": "uint8"}}, {"name": "176/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.23380831082661946, "scale": 0.0020875742038091024, "dtype": "uint8"}}, {"name": "177/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.1448422223329544, "scale": 0.002034948094218385, "dtype": "uint8"}}, {"name": "177/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.3812039730595607, "scale": 0.002141595354267195, "dtype": "uint8"}}, {"name": "177/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.36827051639556885, "scale": 0.0027279297510782877, "dtype": "uint8"}}, {"name": "177/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.007452561520040035, "scale": 0.0001719214204771846, "dtype": "uint8"}}, {"name": "178/kernel", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"min": -0.5313324236402325, "scale": 0.004580451927933039, "dtype": "uint8"}}, {"name": "179/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": -0.08010468179104376, "scale": 0.002002617044776094, "dtype": "uint8"}}, {"name": "179/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.3812039730595607, "scale": 0.002141595354267195, "dtype": "uint8"}}, {"name": "179/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.23591376472921932, "scale": 0.002457435049262701, "dtype": "uint8"}}, {"name": "179/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 